wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rcu.c
/*!
    \file    gd32h77x_rcu.c
    \brief   RCU driver

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_rcu.h"

/* define clock source */
#define SEL_IRC64MDIV                ((uint16_t)0U)                /* IRC64M is selected as CK_SYS */
#define SEL_HXTAL                    ((uint16_t)1U)                /* HXTAL is selected as CK_SYS */
#define SEL_LPIRC4M                  ((uint16_t)2U)                /* LPIRC4M is selected as CK_SYS */
#define SEL_PLL0P                    ((uint16_t)3U)                /* PLL0P is selected as CK_SYS */
/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT          ((uint32_t)0x000FFFFFU)

/* RCU IRC64M and LPIRC4M adjust value mask and offset */
#define RCU_IRC64M_ADJUST_MASK       ((uint8_t)0x7FU)
#define RCU_LPIRC4M_ADJUST_MASK      ((uint8_t)0x3FU)
#define RCU_LPIRC4M_ADJUST_OFFSET    ((uint32_t)2U)
#define RCU_IRC32K_ADJUST_MASK       ((uint8_t)0x1FU)
#define RCU_IRC32K_ADJUST_OFFSET     ((uint32_t)21U)
/* RCU_PLLxN, RCU_PLLxP, RCU_PLLxQ, RCU_PLLxR offset */
#define RCU_PLLNOFFSET               ((uint32_t)6U)
#define RCU_PLLPOFFSET               ((uint32_t)16U)
#define RCU_PLLROFFSET               ((uint32_t)24U)
#define RCU_PLL1QOFFSET              ((uint32_t)8U)
#define RCU_PLL2QOFFSET              ((uint32_t)16U)

/* RCU parameter mask */
#define RCU_PLL_PQR_MASK            (0xFF800000U)        /* RCU PLL p/q/r parameter mask */

/* function to calculate the PLL output frequency*/
static uint32_t rcu_pll_clock_freq_cal(uint32_t pllinputfreq, uint32_t pll_psc, uint32_t pll_n, uint32_t fracn, uint32_t pll_pqr);

/*!
    \brief      deinitialize the RCU (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_deinit(void)
{
    /* enable IRC64M */
    RCU_CTL |= RCU_CTL_IRC64MEN;
    while(0U == (RCU_CTL & RCU_CTL_IRC64MSTB)) {
    }

    RCU_CFG0 &= ~RCU_CFG0_SCS;

    /* reset CFG0 register */
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_AHBPSC | RCU_CFG0_APB1PSC | RCU_CFG0_APB2PSC |
                  RCU_CFG0_RTCDIV | RCU_CFG0_APB3PSC | RCU_CFG0_APB4PSC | RCU_CFG0_I2C0SEL);
    /* reset CTL register */
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_CKMEN | RCU_CTL_HXTALRDYRST | RCU_CTL_PLL0EN | RCU_CTL_PLL1EN
                 | RCU_CTL_PLL2EN);
    RCU_CTL &= ~(RCU_CTL_HXTALBPS);
    /* reset PLL0 register */
    RCU_PLL0 = 0x01002020U;
    /* reset PLL1 register */
    RCU_PLL1 = 0x01012020U;
    /* reset PLL2 register */
    RCU_PLL2 = 0x01012020U;
    /* reset PLLALL register */
    RCU_PLLALL = 0x00000000U;
    /* reset PLL0FRA register */
    RCU_PLL0FRA = 0x00000000U;
    /* reset PLL1FRA register */
    RCU_PLL1FRA = 0x00000000U;
    /* reset PLL2FRA register */
    RCU_PLL2FRA = 0x00000000U;
    /* reset INT register */
    RCU_INT = 0x14ff0000U;
    /* reset ADDINT register */
    RCU_ADDINT = 0x00700000U;
    /* reset CFG1 register */
    RCU_CFG1 = 0x00003F00U;
    /* reset CFG2 register */
    RCU_CFG2 = 0x00000000U;
    /* reset CFG3 register */
    RCU_CFG3 = 0x00000000U;
    /* reset CFG4 register */
    RCU_CFG4 = 0x00000000U;
    /* reset CFG5 register */
    RCU_CFG5 = 0x00000000U;
    /* reset CFG6 register */
    RCU_CFG6 = 0x00000000U;
    /* reset CKFMCFG0 register */
    RCU_CKFMCFG0 = 0x00000000U;
    /* reset CKFMCFG1 register */
    RCU_CKFMCFG1 = 0x00000000U;
    /* reset CKFMCFG2 register */
    RCU_CKFMCFG2 = 0x00000000U;
}

/*!
    \brief      enable the peripherals clock (API_ID(0x0002U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENETx (x = 0,1): ENET1x clock
      \arg        RCU_ENETxTX (x = 0,1): ENET1TX clock
      \arg        RCU_ENETxRX (x = 0,1): ENET1RXx clock
      \arg        RCU_ENETxPTP (x = 0,1): ENET1PTP clock
      \arg        RCU_USBHSx (x = 0,1): USBHS clock
      \arg        RCU_USBHSxULPI (x = 0,1): USBHSULPI clock
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_DCI: DCI clock
      \arg        RCU_FAC: FAC clock
      \arg        RCU_SDIOx (x = 0,1): SDIO clock
      \arg        RCU_CAU: CAU clock
      \arg        RCU_HAU: HAU clock
      \arg        RCU_TRNG: TRNG clock
      \arg        RCU_TMU: TMU clock
      \arg        RCU_RAMECCMUx (x = 0,1): RAMECCMU clock
      \arg        RCU_FFT: FFT clock
      \arg        RCU_PKCAU: PKCAU clock
      \arg        RCU_ESC: ESC clock
      \arg        RCU_EXMC: EXMC clock
      \arg        RCU_IPA: IPA clock
      \arg        RCU_MDMA: MDMMA clock
      \arg        RCU_OSPIM: OSPIM clock
      \arg        RCU_OSPIx (x = 0,1): OSPI0 clock
      \arg        RCU_DSI: DSI clock
      \arg        RCU_RTDECx (x = 0,1): RTDEC0 clock
      \arg        RCU_CPU: CPU clock
      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G,H,J,K): GPIO ports clock
      \arg        RCU_BKPSRAM: BKPSRAM clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_HWSEM: HWSEM clock
      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,14,15,16,22,23,30,31,40,41,42,43,44,50,51): TIMER clock
      \arg        RCU_RSPDIF: RSPDIF clock
      \arg        RCU_SPIx (x = 0,1,2,3,4,5): SPI clock
      \arg        RCU_MDIO: MDIO clock
      \arg        RCU_USARTx (x = 0,1,2,5): USART clock
      \arg        RCU_UARTx (x = 3,4,6,7): UART clock
      \arg        RCU_I2Cx (x = 0,1,2,3): I2C clock
      \arg        RCU_CTC: CTC clock
      \arg        RCU_DACHOLD: DACHOLD clock
      \arg        RCU_DAC: DAC clock
      \arg        RCU_ADCx (x = 0,1,2): ADC clock
      \arg        RCU_HPDF: HPDF clock
      \arg        RCU_SAIx (x = 0,1,2): SAI clock
      \arg        RCU_EDOUT: EDOUT clock
      \arg        RCU_TRIGSEL: TRIGSEL clock
      \arg        RCU_TLI: TLI clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_SYSCFG: SYSCFG clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_VREF: VREF clock
      \arg        RCU_LPDTS: LPDTS clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_RTC: RTC clock
      \arg        RCU_CANx (x = 0,1,2): can clock
      \arg        RCU_AFMT: AFMT clock
      \arg        RCU_TFMT: TFMT clock
      \arg        RCU_ENDAT: ENDAT clock
      \arg        RCU_BISS: BISS clock
      \arg        RCU_HDSL: HDSL clock
      \arg        RCU_RDCM: RDCM clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_enable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock (API_ID(0x0003U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENETx (x = 0,1): ENET1x clock
      \arg        RCU_ENETxTX (x = 0,1): ENET1TX clock
      \arg        RCU_ENETxRX (x = 0,1): ENET1RXx clock
      \arg        RCU_ENETxPTP (x = 0,1): ENET1PTP clock
      \arg        RCU_USBHSx (x = 0,1): USBHS clock
      \arg        RCU_USBHSxULPI (x = 0,1): USBHSULPI clock
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_DCI: DCI clock
      \arg        RCU_FAC: FAC clock
      \arg        RCU_SDIOx (x = 0,1): SDIO clock
      \arg        RCU_CAU: CAU clock
      \arg        RCU_HAU: HAU clock
      \arg        RCU_TRNG: TRNG clock
      \arg        RCU_TMU: TMU clock
      \arg        RCU_RAMECCMUx (x = 0,1): RAMECCMU clock
      \arg        RCU_FFT: FFT clock
      \arg        RCU_PKCAU: PKCAU clock
      \arg        RCU_ESC: ESC clock
      \arg        RCU_EXMC: EXMC clock
      \arg        RCU_IPA: IPA clock
      \arg        RCU_MDMA: MDMMA clock
      \arg        RCU_OSPIM: OSPIM clock
      \arg        RCU_OSPIx (x = 0,1): OSPI0 clock
      \arg        RCU_DSI: DSI clock
      \arg        RCU_RTDECx (x = 0,1): RTDEC0 clock
      \arg        RCU_CPU: CPU clock
      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G,H,J,K): GPIO ports clock
      \arg        RCU_BKPSRAM: BKPSRAM clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_HWSEM: HWSEM clock
      \arg        RCU_TIMERx (x = 0,1,2,3,4,5,6,7,14,15,16,22,23,30,31,40,41,42,43,44,50,51): TIMER clock
      \arg        RCU_RSPDIF: RSPDIF clock
      \arg        RCU_SPIx (x = 0,1,2,3,4,5): SPI clock
      \arg        RCU_MDIO: MDIO clock
      \arg        RCU_USARTx (x = 0,1,2,5): USART clock
      \arg        RCU_UARTx (x = 3,4,6,7): UART clock
      \arg        RCU_I2Cx (x = 0,1,2,3): I2C clock
      \arg        RCU_CTC: CTC clock
      \arg        RCU_DACHOLD: DACHOLD clock
      \arg        RCU_DAC: DAC clock
      \arg        RCU_ADCx (x = 0,1,2): ADC clock
      \arg        RCU_HPDF: HPDF clock
      \arg        RCU_SAIx (x = 0,1,2,3): SAI clock
      \arg        RCU_EDOUT: EDOUT clock
      \arg        RCU_TRIGSEL: TRIGSEL clock
      \arg        RCU_TLI: TLI clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_SYSCFG: SYSCFG clock
      \arg        RCU_CMP: CMP clock
      \arg        RCU_VREF: VREF clock
      \arg        RCU_LPDTS: LPDTS clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_RTC: RTC clock
      \arg        RCU_CANx (x = 0,1,2): can clock
      \arg        RCU_AFMT: AFMT clock
      \arg        RCU_TFMT: TFMT clock
      \arg        RCU_ENDAT: ENDAT clock
      \arg        RCU_BISS: BISS clock
      \arg        RCU_HDSL: HDSL clock
      \arg        RCU_RDCM: RDCM clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_disable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      enable the peripherals clock when sleep mode (API_ID(0x0004U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENETx_SLP (x = 0,1): ENET clock when sleep mode
      \arg        RCU_ENETxTX_SLP (x = 0,1): ENETTX clock when sleep mode
      \arg        RCU_ENETxRX_SLP (x = 0,1): ENETRX clock when sleep mode
      \arg        RCU_ENETxPTP_SLP (x = 0,1): ENETPTP clock when sleep mode
      \arg        RCU_USBHSx_SLP (x = 0,1): USBHS clock when sleep mode
      \arg        RCU_USBHSxULPI_SLP (x = 0,1): USBHSULPI clock when sleep mode
      \arg        RCU_SRAM0_SLP: SRAM0 clock when sleep mode
      \arg        RCU_SRAM1_SLP: SRAM1 clock when sleep mode
      \arg        RCU_DMAx_SLP (x = 0,1): DMA clock when sleep mode
      \arg        RCU_DMAMUX_SLP: DMAMUX clock when sleep mode
      \arg        RCU_DCI_SLP: DCI clock when sleep mode
      \arg        RCU_FAC_SLP: TRNG clock when sleep mode
      \arg        RCU_SDIOx_SLP (x = 0,1): SDIO clock when sleep mode
      \arg        RCU_CAU_SLP: CAU clock when sleep mode
      \arg        RCU_HAU_SLP: HAU clock when sleep mode
      \arg        RCU_GPSI: GPSI clock when sleep mode
      \arg        RCU_TRNG_SLP: TRNG clock when sleep mode
      \arg        RCU_TMU_SLP: TMU clock when sleep mode
      \arg        RCU_RAMECCMUx_SLP (x = 0,1): RAMECCMU clock when sleep mode
      \arg        RCU_EXMC_SLP: EXMC clock when sleep mode
      \arg        RCU_PKCAU: PKCAU clock when sleep mode
      \arg        RCU_FFT: FFT clock when sleep mode
      \arg        RCU_ESC: ESC clock when sleep mode
      \arg        RCU_IPA_SLP: IPA clock when sleep mode
      \arg        RCU_SDIOx_SLP (x = 0,1): SDIO clock when sleep mode
      \arg        RCU_MDMA_SLP: MDMMA clock when sleep mode
      \arg        RCU_OSPIM_SLP: OSPIM clock when sleep mode
      \arg        RCU_OSPIx_SLP (x = 0,1): OSPI0 clock when sleep mode
      \arg        RCU_DSI_SLP: DSI clock when sleep mode
      \arg        RCU_RTDECx_SLP (x = 0,1): RTDEC0 clock when sleep mode
      \arg        RCU_AXISRAM_SLP: AXISRAM clock when sleep mode
      \arg        RCU_NVMC_SLP: NVMC clock when sleep mode
      \arg        RCU_GPIOx_SLP (x = A,B,C,D,E,F,G,H,J,K): GPIO ports clock when sleep mode
      \arg        RCU_BKPSRAM_SLP: BKPSRAM clock when sleep mode
      \arg        RCU_CRC_SLP: CRC clock when sleep mode
      \arg        RCU_TIMERx_SLP (x = 0,1,2,3,4,5,6,7,14,15,16,22,23,30,31,40,41,42,43,44,50,51): TIMER clock when sleep mode
      \arg        RCU_RSPDIF_SLP: RSPDIF clock when sleep mode
      \arg        RCU_SPIx_SLP (x = 0,1,2,3,4,5): SPI clock when sleep mode
      \arg        RCU_MDIO_SLP: MDIO clock when sleep mode
      \arg        RCU_USARTx_SLP (x = 0,1,2,5): USART clock when sleep mode
      \arg        RCU_UARTx_SLP (x = 3,4,6,7): UART clock when sleep mode
      \arg        RCU_I2Cx_SLP (x = 0,1,2,3): I2C clock when sleep mode
      \arg        RCU_CTC_SLP: CTC clock when sleep mode
      \arg        RCU_DACHOLD_SLP: DACHOLD clock when sleep mode
      \arg        RCU_DAC_SLP: DAC clock when sleep mode
      \arg        RCU_ADCx_SLP (x = 0,1,2): ADC clock when sleep mode
      \arg        RCU_HPDF_SLP: HPDF clock when sleep mode
      \arg        RCU_SAIx_SLP (x = 0,1,2,3): SAI clock when sleep mode
      \arg        RCU_EDOUT_SLP: EDOUT clock when sleep mode
      \arg        RCU_TRIGSEL_SLP: TRIGSEL clock when sleep mode
      \arg        RCU_TLI_SLP: TLI clock when sleep mode
      \arg        RCU_WWDGT_SLP: WWDGT clock when sleep mode
      \arg        RCU_SYSCFG_SLP: SYSCFG clock when sleep mode
      \arg        RCU_CMP_SLP: CMP clock when sleep mode
      \arg        RCU_VREF_SLP: VREF clock when sleep mode
      \arg        RCU_LPDTS_SLP: LPDTS clock when sleep mode
      \arg        RCU_PMU_SLP: PMU clock when sleep mode
      \arg        RCU_CANx_SLP (x = 0,1,2): can clock when sleep mode
      \arg        RCU_AFMT_SLP: AFMT clock when sleep mode
      \arg        RCU_TFMT_SLP: TFMT clock when sleep mode
      \arg        RCU_ENDAT_SLP: ENDAT clock when sleep mode
      \arg        RCU_BISS_SLP: BISS clock when sleep mode
      \arg        RCU_HDSL_SLP: HDSL clock when sleep mode
      \arg        RCU_RDCM_SLP: RDCM clock when sleep mode
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock when sleep mode (API_ID(0x0005U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENETx_SLP (x = 0,1): ENET clock when sleep mode
      \arg        RCU_ENETxTX_SLP (x = 0,1): ENETTX clock when sleep mode
      \arg        RCU_ENETxRX_SLP (x = 0,1): ENETRX clock when sleep mode
      \arg        RCU_ENETxPTP_SLP (x = 0,1): ENETPTP clock when sleep mode
      \arg        RCU_USBHSx_SLP (x = 0,1): USBHS clock when sleep mode
      \arg        RCU_USBHSxULPI_SLP (x = 0,1): USBHSULPI clock when sleep mode
      \arg        RCU_SRAM0_SLP: SRAM0 clock when sleep mode
      \arg        RCU_SRAM1_SLP: SRAM1 clock when sleep mode
      \arg        RCU_DMAx_SLP (x = 0,1): DMA clock when sleep mode
      \arg        RCU_DMAMUX_SLP: DMAMUX clock when sleep mode
      \arg        RCU_DCI_SLP: DCI clock when sleep mode
      \arg        RCU_FAC_SLP: TRNG clock when sleep mode
      \arg        RCU_SDIOx_SLP (x = 0,1): SDIO clock when sleep mode
      \arg        RCU_CAU_SLP: CAU clock when sleep mode
      \arg        RCU_HAU_SLP: HAU clock when sleep mode
      \arg        RCU_GPSI: GPSI clock when sleep mode
      \arg        RCU_TRNG_SLP: TRNG clock when sleep mode
      \arg        RCU_TMU_SLP: TMU clock when sleep mode
      \arg        RCU_RAMECCMUx_SLP (x = 0,1): RAMECCMU clock when sleep mode
      \arg        RCU_EXMC_SLP: EXMC clock when sleep mode
      \arg        RCU_PKCAU: PKCAU clock when sleep mode
      \arg        RCU_FFT: FFT clock when sleep mode
      \arg        RCU_ESC: ESC clock when sleep mode
      \arg        RCU_IPA_SLP: IPA clock when sleep mode
      \arg        RCU_SDIOx_SLP (x = 0,1): SDIO clock when sleep mode
      \arg        RCU_MDMA_SLP: MDMMA clock when sleep mode
      \arg        RCU_OSPIM_SLP: OSPIM clock when sleep mode
      \arg        RCU_OSPIx_SLP (x = 0,1): OSPI0 clock when sleep mode
      \arg        RCU_DSI_SLP: DSI clock when sleep mode
      \arg        RCU_RTDECx_SLP (x = 0,1): RTDEC0 clock when sleep mode
      \arg        RCU_AXISRAM_SLP: AXISRAM clock when sleep mode
      \arg        RCU_NVMC_SLP: NVMC clock when sleep mode
      \arg        RCU_GPIOx_SLP (x = A,B,C,D,E,F,G,H,J,K): GPIO ports clock when sleep mode
      \arg        RCU_BKPSRAM_SLP: BKPSRAM clock when sleep mode
      \arg        RCU_CRC_SLP: CRC clock when sleep mode
      \arg        RCU_TIMERx_SLP (x = 0,1,2,3,4,5,6,7,14,15,16,22,23,30,31,40,41,42,43,44,50,51): TIMER clock when sleep mode
      \arg        RCU_RSPDIF_SLP: RSPDIF clock when sleep mode
      \arg        RCU_SPIx_SLP (x = 0,1,2,3,4,5): SPI clock when sleep mode
      \arg        RCU_MDIO_SLP: MDIO clock when sleep mode
      \arg        RCU_USARTx_SLP (x = 0,1,2,5): USART clock when sleep mode
      \arg        RCU_UARTx_SLP (x = 3,4,6,7): UART clock when sleep mode
      \arg        RCU_I2Cx_SLP (x = 0,1,2,3): I2C clock when sleep mode
      \arg        RCU_CTC_SLP: CTC clock when sleep mode
      \arg        RCU_DACHOLD_SLP: DACHOLD clock when sleep mode
      \arg        RCU_DAC_SLP: DAC clock when sleep mode
      \arg        RCU_ADCx_SLP (x = 0,1,2): ADC clock when sleep mode
      \arg        RCU_HPDF_SLP: HPDF clock when sleep mode
      \arg        RCU_SAIx_SLP (x = 0,1,2,3): SAI clock when sleep mode
      \arg        RCU_EDOUT_SLP: EDOUT clock when sleep mode
      \arg        RCU_TRIGSEL_SLP: TRIGSEL clock when sleep mode
      \arg        RCU_TLI_SLP: TLI clock when sleep mode
      \arg        RCU_WWDGT_SLP: WWDGT clock when sleep mode
      \arg        RCU_SYSCFG_SLP: SYSCFG clock when sleep mode
      \arg        RCU_CMP_SLP: CMP clock when sleep mode
      \arg        RCU_VREF_SLP: VREF clock when sleep mode
      \arg        RCU_LPDTS_SLP: LPDTS clock when sleep mode
      \arg        RCU_PMU_SLP: PMU clock when sleep mode
      \arg        RCU_CANx_SLP (x = 0,1,2): can clock when sleep mode
      \arg        RCU_AFMT_SLP: AFMT clock when sleep mode
      \arg        RCU_TFMT_SLP: TFMT clock when sleep mode
      \arg        RCU_ENDAT_SLP: ENDAT clock when sleep mode
      \arg        RCU_BISS_SLP: BISS clock when sleep mode
      \arg        RCU_HDSL_SLP: HDSL clock when sleep mode
      \arg        RCU_RDCM_SLP: RDCM clock when sleep mode
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      reset the peripherals (API_ID(0x0006U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENETxRST (x = 0,1): ENET reset
      \arg        RCU_USBHSxRST (x = 0,1): USBHS reset
      \arg        RCU_DMAxRST (x = 0,1): DMA reset
      \arg        RCU_DMAMUXRST: DMAMUX reset
      \arg        RCU_DCIRST: DCI and GPSI reset
      \arg        RCU_FACRST: FAC reset
      \arg        RCU_SDIOxRST (x = 0,1): SDIO reset
      \arg        RCU_CAURST: CAU reset
      \arg        RCU_HAURST: HAU reset
      \arg        RCU_TRNGRST: TRNG reset
      \arg        RCU_TMURST: TMU reset
      \arg        RCU_PKCAURST: PKCAU reset
      \arg        RCU_FFTRST: FFT reset
      \arg        RCU_PKCAURST: PKCAU reset
      \arg        RCU_ESCRST: ESC reset
      \arg        RCU_IPARST: IPA reset
      \arg        RCU_MDMARST: MDMA reset
      \arg        RCU_OSPIMRST (x = 0,1): OSPIM reset
      \arg        RCU_OSPIxRST (x = 0,1): OSPI reset
      \arg        RCU_DSIRST: DSI reset
      \arg        RCU_RTDECxRST (x = 0,1): RTDEC reset
      \arg        RCU_GPIOxRST (x = A,B,C,D,E,F,G,H,J,K): GPIO ports reset
      \arg        RCU_CRCRST: CRC reset
      \arg        RCU_HWSEMRST: HWSEM reset
      \arg        RCU_TIMERxRST (x = 0,1,2,3,4,5,6,7,14,15,16,22,23,30,31,40,41,42,43,44,50,51): TIMER reset
      \arg        RCU_RSPDIFRST: RSPDIF reset
      \arg        RCU_SPIxRST (x = 0,1,2,3,4,5): SPI reset
      \arg        RCU_MDIORST: MDIO reset
      \arg        RCU_USARTxRST (x = 0,1,2,5): USART reset
      \arg        RCU_UARTxRST (x = 3,4,6,7): UART reset
      \arg        RCU_I2CxRST (x = 0,1,2,3): I2C reset
      \arg        RCU_CTCRST: CTC reset
      \arg        RCU_DACHOLDRST: DACHOLD reset
      \arg        RCU_DACRST: DAC reset
      \arg        RCU_ADCxRST (x = 0,1,2): ADC reset
      \arg        RCU_HPDFRST: HPDF reset
      \arg        RCU_SAIxRST (x = 0,1,2,3): SAI reset
      \arg        RCU_EDOUTRST: EDOUT reset
      \arg        RCU_TRIGSELRST: TRIGSEL reset
      \arg        RCU_TLIRST: TLI reset
      \arg        RCU_WWDGTRST: WWDGT reset
      \arg        RCU_SYSCFGRST: SYSCFG reset
      \arg        RCU_CMPRST: CMP reset
      \arg        RCU_VREFRST: VREF reset
      \arg        RCU_LPDTSRST: LPDTS reset
      \arg        RCU_PMURST: PMU reset
      \arg        RCU_CANxRST (x = 0,1,2): CAN reset
      \arg        RCU_AFMTRST: AFMT reset
      \arg        RCU_TFMTRST: TFMT reset
      \arg        RCU_ENDATRST: ENDAT reset
      \arg        RCU_BISSRST: BISS reset
      \arg        RCU_HDSLRST: HDSL reset
      \arg        RCU_RDCMRST: RDCM reset
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) |= BIT(RCU_BIT_POS(periph_reset));
}

