wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rcu.c
/*!
    \brief      disable reset the peripheral (API_ID(0x0007U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENETxRST (x = 0,1): ENET reset
      \arg        RCU_USBHSxRST (x = 0,1): USBHS reset
      \arg        RCU_DMAxRST (x = 0,1): DMA reset
      \arg        RCU_DMAMUXRST: DMAMUX reset
      \arg        RCU_DCIRST: DCI and GPSI reset
      \arg        RCU_FACRST: FAC reset
      \arg        RCU_SDIOxRST (x = 0,1): SDIO reset
      \arg        RCU_CAURST: CAU reset
      \arg        RCU_HAURST: HAU reset
      \arg        RCU_TRNGRST: TRNG reset
      \arg        RCU_TMURST: TMU reset
      \arg        RCU_PKCAURST: PKCAU reset
      \arg        RCU_FFTRST: FFT reset
      \arg        RCU_PKCAURST: PKCAU reset
      \arg        RCU_ESCRST: ESC reset
      \arg        RCU_IPARST: IPA reset
      \arg        RCU_MDMARST: MDMA reset
      \arg        RCU_OSPIMRST (x = 0,1): OSPIM reset
      \arg        RCU_OSPIxRST (x = 0,1): OSPI reset
      \arg        RCU_DSIRST: DSI reset
      \arg        RCU_RTDECxRST (x = 0,1): RTDEC reset
      \arg        RCU_GPIOxRST (x = A,B,C,D,E,F,G,H,J,K): GPIO ports reset
      \arg        RCU_CRCRST: CRC reset
      \arg        RCU_HWSEMRST: HWSEM reset
      \arg        RCU_TIMERxRST (x = 0,1,2,3,4,5,6,7,14,15,16,22,23,30,31,40,41,42,43,44,50,51): TIMER reset
      \arg        RCU_RSPDIFRST: RSPDIF reset
      \arg        RCU_SPIxRST (x = 0,1,2,3,4,5): SPI reset
      \arg        RCU_MDIORST: MDIO reset
      \arg        RCU_USARTxRST (x = 0,1,2,5): USART reset
      \arg        RCU_UARTxRST (x = 3,4,6,7): UART reset
      \arg        RCU_I2CxRST (x = 0,1,2,3): I2C reset
      \arg        RCU_CTCRST: CTC reset
      \arg        RCU_DACHOLDRST: DACHOLD reset
      \arg        RCU_DACRST: DAC reset
      \arg        RCU_ADCxRST (x = 0,1,2): ADC reset
      \arg        RCU_HPDFRST: HPDF reset
      \arg        RCU_SAIxRST (x = 0,1,2,3): SAI reset
      \arg        RCU_EDOUTRST: EDOUT reset
      \arg        RCU_TRIGSELRST: TRIGSEL reset
      \arg        RCU_TLIRST: TLI reset
      \arg        RCU_WWDGTRST: WWDGT reset
      \arg        RCU_SYSCFGRST: SYSCFG reset
      \arg        RCU_CMPRST: CMP reset
      \arg        RCU_VREFRST: VREF reset
      \arg        RCU_LPDTSRST: LPDTS reset
      \arg        RCU_PMURST: PMU reset
      \arg        RCU_CANxRST (x = 0,1,2): CAN reset
      \arg        RCU_AFMTRST: AFMT reset
      \arg        RCU_TFMTRST: TFMT reset
      \arg        RCU_ENDATRST: ENDAT reset
      \arg        RCU_BISSRST: BISS reset
      \arg        RCU_HDSLRST: HDSL reset
      \arg        RCU_RDCMRST: RDCM reset
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) &= ~BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      reset the BKP (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_BKPRST;
}

/*!
    \brief      disable the BKP reset (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_bkp_reset_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_BKPRST;
}

/*!
    \brief      reset the HXTAL ready (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_ready_reset_enable(void)
{
    RCU_CTL |= RCU_CTL_HXTALRDYRST;
}

/*!
    \brief      disable the HXTAL ready reset (API_ID(0x000BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_ready_reset_disable(void)
{
    RCU_CTL &= ~RCU_CTL_HXTALRDYRST;
}

/*!
    \brief      reset the LXTAL ready (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_ready_reset_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_LXTALRDYRST;
}

/*!
    \brief      disable the LXTAL ready reset (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_ready_reset_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_LXTALRDYRST;
}

/*!
    \brief      LXTAL start circuit control (API_ID(0x000EU))
    \param[in]  control: LXTAL start circuit control
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_START_CIRCUIT_CLOSE: close the start circuit when LXTAL is ready
      \arg        RCU_LXTAL_START_CIRCUIT_HOLD: hold the start circuit when LXTAL is ready
    \param[out] none
    \retval     none
*/
void rcu_lxtal_start_circuit_control(uint32_t control)
{
    uint32_t reg;

    reg = RCU_BDCTL;
    reg &= ~RCU_BDCTL_LXTALSTARTON;
    RCU_BDCTL = reg | (control & RCU_BDCTL_LXTALSTARTON);
}

/*!
    \brief      configure the system clock source (API_ID(0x000FU))
    \param[in]  ck_sys: system clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKSYSSRC_IRC64MDIV: select CK_IRC64MDIV as the CK_SYS source
      \arg        RCU_CKSYSSRC_HXTAL: select CK_HXTAL as the CK_SYS source
      \arg        RCU_CKSYSSRC_LPIRC4M: select CK_LPIRC4M as the CK_SYS source
      \arg        RCU_CKSYSSRC_PLL0P: select CK_PLL0P as the CK_SYS source
    \param[out] none
    \retval     none
*/
void rcu_system_clock_source_config(uint32_t ck_sys)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the SCS bits and set according to ck_sys */
    reg &= ~RCU_CFG0_SCS;
    RCU_CFG0 = reg | (ck_sys & RCU_CFG0_SCS);
}

/*!
    \brief      get the system clock source (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     which clock is selected as CK_SYS source
      \arg        RCU_SCSS_IRC64MDIV: CK_IRC64MDIV is selected as the CK_SYS source
      \arg        RCU_SCSS_HXTAL: CK_HXTAL is selected as the CK_SYS source
      \arg        RCU_SCSS_LPIRC4M: CK_LPIRC4M is selected as the CK_SYS source
      \arg        RCU_SCSS_PLL0P: CK_PLL0P is selected as the CK_SYS source
*/
uint32_t rcu_system_clock_source_get(void)
{
    return RCU_CFG0 & RCU_CFG0_SCSS;
}

/*!
    \brief      configure the AHB clock prescaler selection (API_ID(0x0011U))
    \param[in]  ck_ahb: AHB clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_AHB_CKSYS_DIVx: (x = 1, 2, 4, 8, 16, 64, 128, 256, 512): CK_AHB is CK_SYS/x
    \param[out] none
    \retval     none
*/
void rcu_ahb_clock_config(uint32_t ck_ahb)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the AHBPSC bits and set according to ck_ahb */
    reg &= ~RCU_CFG0_AHBPSC;
    RCU_CFG0 = reg | (ck_ahb & RCU_CFG0_AHBPSC);
}

/*!
    \brief      configure the APB1 clock prescaler selection (API_ID(0x0012U))
    \param[in]  ck_apb1: APB1 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB1_CKAHB_DIV1: select CK_AHB as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV2: select CK_AHB / 2 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV4: select CK_AHB / 4 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV8: select CK_AHB / 8 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV16: select CK_AHB / 16 as CK_APB1
    \param[out] none
    \retval     none
*/
void rcu_apb1_clock_config(uint32_t ck_apb1)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the APB1PSC and set according to ck_apb1 */
    reg &= ~RCU_CFG0_APB1PSC;
    RCU_CFG0 = reg | (ck_apb1 & RCU_CFG0_APB1PSC);
}

/*!
    \brief      configure the APB2 clock prescaler selection (API_ID(0x0013U))
    \param[in]  ck_apb2: APB2 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB2_CKAHB_DIV1: select CK_AHB as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV2: select CK_AHB / 2 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV4: select CK_AHB / 4 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV8: select CK_AHB / 8 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV16: select CK_AHB / 16 as CK_APB2
    \param[out] none
    \retval     none
*/
void rcu_apb2_clock_config(uint32_t ck_apb2)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the APB2PSC and set according to ck_apb2 */
    reg &= ~RCU_CFG0_APB2PSC;
    RCU_CFG0 = reg | (ck_apb2 & RCU_CFG0_APB2PSC);
}

/*!
    \brief      configure the APB3 clock prescaler selection (API_ID(0x0014U))
    \param[in]  ck_apb3: APB3 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB3_CKAHB_DIV1: select CK_AHB as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV2: select CK_AHB / 2 as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV4: select CK_AHB / 4 as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV8: select CK_AHB / 8 as CK_APB3
      \arg        RCU_APB3_CKAHB_DIV16: select CK_AHB/ 16 as CK_APB3
    \param[out] none
    \retval     none
*/
void rcu_apb3_clock_config(uint32_t ck_apb3)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the APB3PSC and set according to ck_apb3 */
    reg &= ~RCU_CFG0_APB3PSC;
    RCU_CFG0 = reg | (ck_apb3 & RCU_CFG0_APB3PSC);
}

/*!
    \brief      configure the APB4 clock prescaler selection (API_ID(0x0015U))
    \param[in]  ck_apb4: APB4 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB4_CKAHB_DIV1: select CK_AHB as CK_APB4
      \arg        RCU_APB4_CKAHB_DIV2: select CK_AHB / 2 as CK_APB4
      \arg        RCU_APB4_CKAHB_DIV4: select CK_AHB / 4 as CK_APB4
      \arg        RCU_APB4_CKAHB_DIV8: select CK_AHB / 8 as CK_APB4
      \arg        RCU_APB4_CKAHB_DIV16: select CK_AHB / 16 as CK_APB4
    \param[out] none
    \retval     none
*/
void rcu_apb4_clock_config(uint32_t ck_apb4)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the APB4PSC and set according to ck_apb4 */
    reg &= ~RCU_CFG0_APB4PSC;
    RCU_CFG0 = reg | (ck_apb4 & RCU_CFG0_APB4PSC);
}

/*!
    \brief      configure the CK_OUT0 clock source and divider (API_ID(0x0016U))
    \param[in]  ckout0_src: CK_OUT0 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT0SRC_IRC64MDIV: IRC64M selected
      \arg        RCU_CKOUT0SRC_LXTAL: LXTAL selected
      \arg        RCU_CKOUT0SRC_HXTAL: HXTAL selected
      \arg        RCU_CKOUT0SRC_PLL0P: PLL0P selected
      \arg        RCU_CKOUT0SRC_IRC48M: IRC48M selected
      \arg        RCU_CKOUT0SRC_PER: PER selected
      \arg        RCU_CKOUT0SRC_USBHS060M: USBHS0 60M selected
      \arg        RCU_CKOUT0SRC_USBHS160M: USBHS1 60M selected
    \param[in]  ckout0_div: CK_OUT0 divider
      \arg        RCU_CKOUT0_DIVx (x = 1,2,3,...15): CK_OUT0 is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout0_config(uint32_t ckout0_src, uint32_t ckout0_div)
{
    uint32_t reg;

    reg = RCU_CFG2;
    /* reset the CKOUT0SRC, CKOUT0DIV and set according to ckout0_src and ckout0_div */
    reg &= ~(RCU_CFG2_CKOUT0SEL | RCU_CFG2_CKOUT0DIV);
    RCU_CFG2 = reg | (ckout0_src & RCU_CFG2_CKOUT0SEL) | (ckout0_div & RCU_CFG2_CKOUT0DIV);
}

/*!
    \brief      configure the CK_OUT1 clock source and divider (API_ID(0x0017U))
    \param[in]  ckout1_src: CK_OUT1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT1SRC_SYSTEMCLOCK: system clock selected
      \arg        RCU_CKOUT1SRC_PLL1R: PLL1R selected
      \arg        RCU_CKOUT1SRC_HXTAL: HXTAL selected
      \arg        RCU_CKOUT1SRC_PLL0P: PLL0P selected
      \arg        RCU_CKOUT1SRC_LPIRC4M: LPIRC4M selected
      \arg        RCU_CKOUT1SRC_IRC32K: IRC32K selected
      \arg        RCU_CKOUT1SRC_PLL2R: PLL2R selected
    \param[in]  ckout1_div: CK_OUT1 divider
      \arg        RCU_CKOUT1_DIVx (x = 1,2,3,....15): CK_OUT1 is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout1_config(uint32_t ckout1_src, uint32_t ckout1_div)
{
    uint32_t reg;

    reg = RCU_CFG2;
    /* reset the CKOUT1SRC, CKOUT1DIV and set according to ckout1_src and ckout1_div */
    reg &= ~(RCU_CFG2_CKOUT1SEL | RCU_CFG2_CKOUT1DIV);
    RCU_CFG2 = reg | (ckout1_src & RCU_CFG2_CKOUT1SEL) | (ckout1_div & RCU_CFG2_CKOUT1DIV);
}

/*!
    \brief      configure the PLL input and output clock range (API_ID(0x0018U))
    \param[in]  pll_idx: IDX_PLL, IDX_PLLx (x = 0,1,2)
    \param[in]  ck_input: input clock range
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLxRNG_1M_2M (x = 0,1,2): input clock frequency: 1-2MHz
      \arg        RCU_PLLxRNG_2M_4M (x = 0,1,2): input clock frequency: 2-4MHz
      \arg        RCU_PLLxRNG_4M_8M (x = 0,1,2): input clock frequency: 4-8MHz
      \arg        RCU_PLLxRNG_8M_16M: input clock frequency: 8-16MHz
     \param[in]  ck_output: output clock range
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLxVCO_192M_836M (x = 0,1,2): select wide VCO, range: 192-836MHz
      \arg        RCU_PLLxVCO_150M_420M (x = 0,1,2): select narrow VCO, range: 150-420MHz
    \param[out] none
    \retval     none
*/
void rcu_pll_input_output_clock_range_config(pll_idx_enum pll_idx, uint32_t ck_input, uint32_t ck_output)
{
    switch(pll_idx) {
    case IDX_PLL0:
        /* reset the PLLRNG/PLLVCOSEL bits and set according to ck_input/ck_output */
        RCU_PLLALL &= ~(RCU_PLLALL_PLL0RNG | RCU_PLLALL_PLL0VCOSEL);
        RCU_PLLALL |= (ck_input & RCU_PLLALL_PLL0RNG) | (ck_output & RCU_PLLALL_PLL0VCOSEL);
        break;
    case IDX_PLL1:
        /* reset the PLLRNG/PLLVCOSEL bits and set according to ck_input/ck_output */
        RCU_PLLALL &= ~(RCU_PLLALL_PLL1RNG | RCU_PLLALL_PLL1VCOSEL);
        RCU_PLLALL |= (ck_input & RCU_PLLALL_PLL1RNG) | (ck_output & RCU_PLLALL_PLL1VCOSEL);
        break;
    case IDX_PLL2:
        /* reset the PLLRNG/PLLVCOSEL bits and set according to ck_input/ck_output */
        RCU_PLLALL &= ~(RCU_PLLALL_PLL2RNG | RCU_PLLALL_PLL2VCOSEL);
        RCU_PLLALL |= (ck_input & RCU_PLLALL_PLL2RNG) | (ck_output & RCU_PLLALL_PLL2VCOSEL);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure fractional part of the multiplication factor for PLL VCO (API_ID(0x0019U))
    \param[in]  pll_idx: IDX_PLL, IDX_PLLx (x = 0,1,2)
    \param[in]  pll_fracn: fractional part of the multiplication factor
      \arg        this parameter should be selected between 0 and 8191
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_config(pll_idx_enum pll_idx, uint32_t pll_fracn)
{
    switch(pll_idx) {
    case IDX_PLL0:
        /* reset the PLLFRAN and set according to pll_fracn */
        RCU_PLL0FRA &= ~(RCU_PLL0FRA_PLL0FRAN);
        RCU_PLL0FRA |= pll_fracn & RCU_PLL0FRA_PLL0FRAN;
        break;
    case IDX_PLL1:
        /* reset the PLLFRAN and set according to pll_fracn */
        RCU_PLL1FRA &= ~(RCU_PLL1FRA_PLL1FRAN);
        RCU_PLL1FRA |= pll_fracn & RCU_PLL1FRA_PLL1FRAN;
        break;
    case IDX_PLL2:
        /* reset the PLLFRAN and set according to pll_fracn */
        RCU_PLL2FRA &= ~(RCU_PLL2FRA_PLL2FRAN);
        RCU_PLL2FRA |= pll_fracn & RCU_PLL2FRA_PLL2FRAN;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable PLL fractional latch (API_ID(0x001AU))
    \param[in]  pll_idx: IDX_PLL,IDX_PLLx (x = 0,1,2)
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_latch_enable(pll_idx_enum pll_idx)
{
    switch(pll_idx) {
    case IDX_PLL0:
        /* set the PLL0FRAEN */
        RCU_PLL0FRA |= RCU_PLL0FRA_PLL0FRAEN ;
        break;
    case IDX_PLL1:
        /* set the PLL1FRAEN */
        RCU_PLL1FRA |= RCU_PLL1FRA_PLL1FRAEN ;
        break;
    case IDX_PLL2:
        /* set the PLL2FRAEN */
        RCU_PLL2FRA |= RCU_PLL2FRA_PLL2FRAEN ;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable PLL fractional latch (API_ID(0x001BU))
    \param[in]  pll_idx: IDX_PLL, IDX_PLLx (x = 1,2)
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_latch_disable(pll_idx_enum pll_idx)
{
    switch(pll_idx) {
    case IDX_PLL0:
        /* reset the PLL0FRAEN */
        RCU_PLL0FRA &= ~RCU_PLL0FRA_PLL0FRAEN ;
        break;
    case IDX_PLL1:
        /* reset the PLL1FRAEN */
        RCU_PLL1FRA &= ~RCU_PLL1FRA_PLL1FRAEN ;
        break;
    case IDX_PLL2:
        /* reset the PLL2FRAEN */
        RCU_PLL2FRA &= ~RCU_PLL2FRA_PLL2FRAEN ;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the PLLs clock source (API_ID(0x001CU))
    \param[in]  pll_src: PLL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLSRC_IRC64MDIV: select IRC64MDIV as PLL source clock
      \arg        RCU_PLLSRC_LPIRC4M: select LPIRC4M as PLL source clock
      \arg        RCU_PLLSRC_HXTAL: select HXTAL as PLL source clock
    \param[out] none
    \retval     none
*/
void rcu_pll_source_config(uint32_t pll_src)
{
    /* PLL clock source selection */
    RCU_PLLALL &= ~(RCU_PLLALL_PLLSEL);
    RCU_PLLALL |= pll_src & RCU_PLLALL_PLLSEL;
}

/*!
    \brief      configure the PLL0 clock source (API_ID(0x001DU))
    \param[in]  pll0_psc: the PLL0 VCO source clock prescaler
      \arg         this parameter should be selected between 1 and 63. When pll0_psc=0, the PLL0 VCO source clock prescaler close.
    \param[in]  pll0_n: the PLL0 VCO clock multi factor
      \arg        this parameter should be selected between 9 and 512
    \param[in]  pll0_p: the PLL0P output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll0_q: the PLL0 Q output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll0_r: the PLL0 R output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pll0_config(uint32_t pll0_psc, uint32_t pll0_n, uint32_t pll0_p, uint32_t pll0_q, uint32_t pll0_r)
{
    ErrStatus status = SUCCESS;

    /* check the function parameter */
    if(CHECK_PLL0_PSC_VALID(pll0_psc) && CHECK_PLL0_N_VALID(pll0_n) &&
            CHECK_PLL0_P_VALID(pll0_p) && CHECK_PLL0_Q_VALID(pll0_q) &&
            CHECK_PLL0_R_VALID(pll0_r)) {
        RCU_PLL0 &= ~(RCU_PLL0_PLL0PSC | RCU_PLL0_PLL0N | RCU_PLL0_PLL0P | RCU_PLL0_PLL0R);
        RCU_PLL0 |= pll0_psc | ((pll0_n - 1U) << RCU_PLLNOFFSET) | ((pll0_p - 1U) << RCU_PLLPOFFSET) |
                    ((pll0_r - 1U) << RCU_PLLROFFSET);
        RCU_PLLADDCTL &= ~RCU_PLLADDCTL_PLL0Q;
        RCU_PLLADDCTL |= (pll0_q - 1U);
    } else {
        /* return status */
        status = ERROR;
    }

    /* return status */
    return status;
}

/*!
    \brief      configure the PLL1 clock (API_ID(0x001EU))
    \param[in]  pll1_psc: the PLL1 VCO source clock prescaler
      \arg         this parameter should be selected between 1 and 63. When pll1_psc = 0,the PLL1 VCO source clock prescaler close.
    \param[in]  pll1_n: the PLL1 VCO clock multi factor
      \arg        this parameter should be selected between 9 and 512
    \param[in]  pll1_p: the PLL1 P output frequency division factor from PLL1 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll1_q: the PLL1 Q output frequency division factor from PLL1 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll1_r: the PLL1 R output frequency division factor from PLL1 VCO clock
      \arg        this parameter should be selected between 1 and 128

    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pll1_config(uint32_t pll1_psc, uint32_t pll1_n, uint32_t pll1_p, uint32_t pll1_q, uint32_t pll1_r)
{
    ErrStatus status = SUCCESS;

    /* check the function parameter */
    if(CHECK_PLL1_PSC_VALID(pll1_psc) && CHECK_PLL1_N_VALID(pll1_n) &&
            CHECK_PLL1_P_VALID(pll1_p) && CHECK_PLL1_Q_VALID(pll1_q) &&
            CHECK_PLL1_R_VALID(pll1_r)) {
        RCU_PLL1 = (pll1_psc | ((pll1_n - 1U) << RCU_PLLNOFFSET) | ((pll1_p - 1U) << RCU_PLLPOFFSET) |
                    ((pll1_r - 1U) << RCU_PLLROFFSET));
        RCU_PLLADDCTL &= ~RCU_PLLADDCTL_PLL1Q;
        RCU_PLLADDCTL |= ((pll1_q - 1U) << RCU_PLL1QOFFSET);
    } else {
        /* return status */
        status = ERROR;
    }

    /* return status */
    return status;
}

/*!
    \brief      configure the PLL2 clock (API_ID(0x001FU))
    \param[in]  pll2_psc: the PLL2 VCO source clock prescaler
      \arg         this parameter should be selected between 0 and 63. When pll2_psc = 0,the PLL2 VCO source clock prescaler close
    \param[in]  pll2_n: the PLL2 VCO clock multi factor
      \arg        this parameter should be selected between 9 and 512
    \param[in]  pll2_p: the PLL2 P output frequency division factor from PLL2 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll2_q: the PLL2 Q output frequency division factor from PLL2 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll2_r: the PLL2 R output frequency division factor from PLL2 VCO clock
      \arg        this parameter should be selected between 1 and 128

    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pll2_config(uint32_t pll2_psc, uint32_t pll2_n, uint32_t pll2_p, uint32_t pll2_q, uint32_t pll2_r)
{
    ErrStatus status = SUCCESS;

    /* check the function parameter */
    if(CHECK_PLL2_PSC_VALID(pll2_psc) && CHECK_PLL2_N_VALID(pll2_n) &&
            CHECK_PLL2_P_VALID(pll2_p) && CHECK_PLL2_R_VALID(pll2_q) &&
            CHECK_PLL2_R_VALID(pll2_r)) {
        RCU_PLL2 = (pll2_psc | ((pll2_n - 1U) << RCU_PLLNOFFSET) | ((pll2_p - 1U) << RCU_PLLPOFFSET) |
                    ((pll2_r - 1U) << RCU_PLLROFFSET));
        RCU_PLLADDCTL &= ~RCU_PLLADDCTL_PLL2Q;
        RCU_PLLADDCTL |= ((pll2_q - 1U) << RCU_PLL2QOFFSET);
    } else {
        /* return status */
        status = ERROR;
    }

    /* return status */
    return status;
}

/*!
    \brief      enable the pllp pllq pllr divider output (API_ID(0x0020U))
    \param[in]  pllxy: the output pll enable
                one or more parameters can be selected which are shown as below:
      \arg        RCU_PLL0P: PLL0P divider output enable
      \arg        RCU_PLL0Q: PLL0Q divider output enable
      \arg        RCU_PLL0R: PLL0R divider output enable
      \arg        RCU_PLL1P: PLL1P divider output enable
      \arg        RCU_PLL1Q: PLL1Q divider output enable
      \arg        RCU_PLL1R: PLL1R divider output enable
      \arg        RCU_PLL2P: PLL2P divider output enable
      \arg        RCU_PLL2Q: PLL2Q divider output enable
      \arg        RCU_PLL2R: PLL2R divider output enable
    \param[out] none
    \retval     none
*/
void rcu_pll_clock_output_enable(uint32_t pllxy)
{
    /* PLL divider output enable */
    RCU_PLLADDCTL |= pllxy & RCU_PLL_PQR_MASK;
}

