wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rcu.c
/*!
    \brief      disable the pllp pllq pllr divider output (API_ID(0x0021U))
    \param[in]  pllxy: the output pll disable
                one or more parameters can be selected which are shown as below:
      \arg        RCU_PLL0P: PLL0P divider output disable
      \arg        RCU_PLL0Q: PLL0Q divider output disable
      \arg        RCU_PLL0R: PLL0R divider output disable
      \arg        RCU_PLL1P: PLL1P divider output disable
      \arg        RCU_PLL1Q: PLL1Q divider output disable
      \arg        RCU_PLL1R: PLL1R divider output disable
      \arg        RCU_PLL2P: PLL2P divider output disable
      \arg        RCU_PLL2Q: PLL2Q divider output disable
      \arg        RCU_PLL2R: PLL2R divider output disable
    \param[out] none
    \retval     none
*/
void rcu_pll_clock_output_disable(uint32_t pllxy)
{
    /* PLL divider output disable */
    RCU_PLLADDCTL &= ~(pllxy & RCU_PLL_PQR_MASK);
}

/*!
    \brief      configure the PLLUSBHS0 clock (API_ID(0x0022U))
    \param[in]  pllusb_presel: PLLUSBHSPRE clock selection
      \arg        this parameter should be selected RCU_PLLUSBHSPRE_HXTAL or RCU_PLLUSBHSPRE_IRC48M
    \param[in]  pllusb_predv: the divider factor from PLLUSBHS clock
      \arg        this parameter should be selected between RCU_PLLUSBHSPRE_DIVx (x = 1...15)
    \param[in]  pllusb_mf: PLLUSBHS0 clock multiplication factor
      \arg        this parameter should be selected RCU_PLLUSBHS_MULx (x = 8,9...127)
    \param[in]  usbhsdv: the divider factor from USBHSDV clock
      \arg        this parameter should be selected RCU_USBHS_DIVx (x = 2,4...16)
    \param[out] none
    \retval     none
*/
void rcu_pllusb0_config(uint32_t pllusb_presel, uint32_t pllusb_predv, uint32_t pllusb_mf, uint32_t usbhsdv)
{
    /* configure PLLUSBHS source selection */
    RCU_USBCLKCTL &= ~(RCU_USBCLKCTL_PLLUSBHS0PRESEL);
    RCU_USBCLKCTL |= (pllusb_presel & RCU_USBCLKCTL_PLLUSBHS0PRESEL);

    RCU_PLLUSBCFG &= ~(RCU_PLLUSBCFG_PLLUSBHS0PREDV | RCU_PLLUSBCFG_USBHS0DV | RCU_PLLUSBCFG_PLLUSBHS0MF);
    RCU_PLLUSBCFG |= (pllusb_predv & RCU_PLLUSBCFG_PLLUSBHS0PREDV) | (usbhsdv & RCU_PLLUSBCFG_USBHS0DV) | (pllusb_mf & RCU_PLLUSBCFG_PLLUSBHS0MF);
}

/*!
    \brief      configure the RTC clock source selection (API_ID(0x0023U))
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC32K: CK_IRC32K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_RTCDIV: CK_HXTAL / RTCDIV selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;

    reg = RCU_BDCTL;
    /* reset the RTCSRC bits and set according to rtc_clock_source */
    reg &= ~RCU_BDCTL_RTCSRC;
    RCU_BDCTL = reg | (rtc_clock_source & RCU_BDCTL_RTCSRC);
}

/*!
    \brief      configure the frequency division of RTC clock when HXTAL was selected as its clock source (API_ID(0x0024U))
    \param[in]  rtc_div: RTC clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTC_HXTAL_NONE: no clock for RTC
      \arg        RCU_RTC_HXTAL_DIVx: RTCDIV clock select CK_HXTAL / x (x = 2,3...63)
    \param[out] none
    \retval     none
*/
void rcu_rtc_div_config(uint32_t rtc_div)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the RTCDIV bits and set according to rtc_div value */
    reg &= ~RCU_CFG0_RTCDIV;
    RCU_CFG0 = reg | (rtc_div & RCU_CFG0_RTCDIV);
}

/*!
    \brief      configure the CK48M clock source selection (API_ID(0x0025U))
    \param[in]  ck48m_clock_source: CK48M clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CK48MSRC_PLL48M: CK_PLL48M selected as CK48M source clock
      \arg        RCU_CK48MSRC_IRC48M: CK_IRC48M selected as CK48M source clock
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_ck48m_clock_config(uint32_t ck48m_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL0;
    /* reset the CK48MSEL bit and set according to ck48m_clock_source */
    reg &= ~RCU_ADDCTL0_CK48MSEL;
    RCU_ADDCTL0 = reg | (ck48m_clock_source & RCU_ADDCTL0_CK48MSEL);
}

/*!
    \brief      configure the PLL48M clock source selection (API_ID(0x0026U))
    \param[in]  pll48m_clock_source: PLL48M clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL48MSRC_PLL0Q: CK_PLL0Q selected as PLL48M source clock
      \arg        RCU_PLL48MSRC_PLL2P: CK_PLL2P selected as PLL48M source clock
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_pll48m_clock_config(uint32_t pll48m_clock_source)
{
    uint32_t reg;

    reg = RCU_ADDCTL0;
    /* reset the PLL48MSEL bit and set according to pll48m_clock_source */
    reg &= ~RCU_ADDCTL0_PLL48MSEL;
    RCU_ADDCTL0 = reg | (pll48m_clock_source & RCU_ADDCTL0_PLL48MSEL);
}

/*!
    \brief      configure the IRC64M clock divider selection (API_ID(0x0027U))
    \param[in]  ck_irc64mdiv: IRC64M clock divider selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC64M_DIV1: CK_IRC64M / 1
      \arg        RCU_IRC64M_DIV2: CK_IRC64M / 2
      \arg        RCU_IRC64M_DIV4: CK_IRC64M / 4
      \arg        RCU_IRC64M_DIV8: CK_IRC64M / 8
    \param[out] none
    \retval     none
*/
void rcu_irc64mdiv_clock_config(uint32_t ck_irc64mdiv)
{
    uint32_t reg;

    reg = RCU_ADDCTL1;
    /* reset the IRC64MDIV and set according to ck_irc64mdiv */
    reg &= ~RCU_ADDCTL1_IRC64MDIV;
    RCU_ADDCTL1 = reg | (ck_irc64mdiv & RCU_ADDCTL1_IRC64MDIV);
}
/*!
    \brief      get the irc64mdiv clock (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     clock frequency of irc64mdiv: 64000000, 32000000, 16000000, 8000000
*/
uint32_t rcu_irc64mdiv_freq_get(void)
{
    uint32_t irc64m_freq = 0U;

    /* CK_IRC64MDIV = CK_IRC64M/1/2/4/8 */
    if(RCU_IRC64M_DIV1 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE;
    } else if(RCU_IRC64M_DIV2 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE / 2U;
    } else if(RCU_IRC64M_DIV4 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE / 4U;
    } else if(RCU_IRC64M_DIV8 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE / 8U;
    } else {
    }

    return irc64m_freq;
}

/*!
    \brief      configure the TIMER clock prescaler selection (API_ID(0x0029U))
    \param[in]  timer_clock_prescaler: TIMER clock selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_TIMER_PSC_MUL2: if APB1PSC / APB2PSC in RCU_CFG0 register is 0b0xx (CK_APBx = CK_AHB)
                                      or 0b100 (CK_APBx = CK_AHB / 2), the TIMER clock is equal to CK_AHB (CK_TIMERx = CK_AHB).
                                      or else, the TIMER clock is twice the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 2 x CK_APB1;
                                      TIMER in APB2 domain: CK_TIMERx = 2 x CK_APB2)
      \arg        RCU_TIMER_PSC_MUL4: if APB1PSC / APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB),
                                      0b100 (CK_APBx = CK_AHB / 2), or 0b101 (CK_APBx = CK_AHB / 4), the TIMER clock is equal to CK_AHB (CK_TIMERx = CK_AHB).
                                      or else, the TIMER clock is four timers the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 4 x CK_APB1;
                                      TIMER in APB2 domain: CK_TIMERx = 4 x CK_APB2)
    \param[out] none
    \retval     none
*/
void rcu_timer_clock_prescaler_config(uint32_t timer_clock_prescaler)
{
    /* configure the TIMERSEL bit and select the TIMER clock prescaler */
    if(timer_clock_prescaler == RCU_TIMER_PSC_MUL2) {
        RCU_CFG1 &= timer_clock_prescaler;
    } else {
        RCU_CFG1 |= timer_clock_prescaler;
    }
}

/*!
    \brief      configure the SPI / I2S clock source selection (API_ID(0x002AU))
    \param[in]  spi_idx: IDX_SPIx (x = 0,1,2,3,4,5)
    \param[in]  ck_spi: SPI0 / SPI1 / SPI2 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SPISRC_PLL0Q: CK_SPI select PLL0Q
      \arg        RCU_SPISRC_PLL1P: CK_SPI select PLL1P
      \arg        RCU_SPISRC_PLL2P: CK_SPI select PLL2P
      \arg        RCU_SPISRC_I2S_CKIN: CK_SPI select I2SCKIN
      \arg        RCU_SPISRC_PER: CK_SPI select PER
    \param[in]  ck_spi: SPI3 / SPI4 / SPI5 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SPISRC_APB2: CK_SPI select CKAPB2
      \arg        RCU_SPISRC_PLL1Q: CK_SPI select PLL1Q
      \arg        RCU_SPISRC_PLL2Q: CK_SPI select PLL2Q
      \arg        RCU_SPISRC_IRC64MDIV: CK_SPI select IRC64MDIV
      \arg        RCU_SPISRC_LPIRC4M: CK_SPI select LPIRC4M
      \arg        RCU_SPISRC_HXTAL: CK_SPI select HXTAL
      \arg        RCU_SPI5SRC_I2S_CKIN: CK_SPI select I2SCKIN (only for SPI5)
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_spi_clock_config(spi_idx_enum spi_idx, uint32_t ck_spi)
{
    switch(spi_idx) {
    case IDX_SPI0:
        /* reset the SPI0SEL bits and set according to ck_spi */
        RCU_CFG5 &= ~RCU_CFG5_SPI0SEL;
        RCU_CFG5 |= ck_spi & RCU_CFG5_SPI0SEL;
        break;
    case IDX_SPI1:
        /* reset the SPI1SEL bits and set according to ck_spi */
        RCU_CFG5 &= ~RCU_CFG5_SPI1SEL;
        RCU_CFG5 |= (ck_spi << 4U) & RCU_CFG5_SPI1SEL;
        break;
    case IDX_SPI2:
        /* reset the SPI2SEL bits and set according to ck_spi */
        RCU_CFG5 &= ~RCU_CFG5_SPI2SEL;
        RCU_CFG5 |= (ck_spi << 8U) & RCU_CFG5_SPI2SEL;
        break;
    case IDX_SPI3:
        /* reset the SPI3SEL bits and set according to ck_spi */
        RCU_CFG5 &= ~RCU_CFG5_SPI3SEL;
        RCU_CFG5 |= ck_spi & RCU_CFG5_SPI3SEL;
        break;
    case IDX_SPI4:
        /* reset the SPI4SEL bits and set according to ck_spi */
        RCU_CFG5 &= ~RCU_CFG5_SPI4SEL;
        RCU_CFG5 |= (ck_spi << 4U) & RCU_CFG5_SPI4SEL;
        break;
    case IDX_SPI5:
        /* reset the SPI5SEL bits and set according to ck_spi */
        RCU_CFG5 &= ~RCU_CFG5_SPI5SEL;
        RCU_CFG5 |= (ck_spi << 8U) & RCU_CFG5_SPI5SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the SDIO clock source selection (API_ID(0x002BU))
    \param[in]  sdio_idx: IDX_SDIOx (x = 0,1)
    \param[in]  ck_sdio: SDIO clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SDIO0SRC_PLL0Q: CK_SDIO0 select PLL0Q (only for SDIO0)
      \arg        RCU_SDIO0SRC_PLL1R: CK_SDIO0 select PLL1R (only for SDIO0)
      \arg        RCU_SDIO1SRC_PLL0Q: CK_SDIO1 select PLL0Q (only for SDIO1)
      \arg        RCU_SDIO1SRC_PLL1R: CK_SDIO1 select PLL1R (only for SDIO1)
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_sdio_clock_config(sdio_idx_enum sdio_idx, uint32_t ck_sdio)
{
    switch(sdio_idx) {
    case IDX_SDIO0:
        /* reset the SDIO0SEL bits and set according to ck_sdio */
        RCU_CFG4 &= ~RCU_CFG4_SDIO0SEL;
        RCU_CFG4 |= ck_sdio & RCU_CFG4_SDIO0SEL;
        break;
    case IDX_SDIO1:
        /* reset the SDIO1SEL bits and set according to ck_sdio */
        RCU_CFG3 &= ~RCU_CFG3_SDIO1SEL;
        RCU_CFG3 |=  ck_sdio & RCU_CFG3_SDIO1SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the Deep-sleep wakeup system clock source selection (API_ID(0x002CU))
    \param[in]  ck_dspwussel: Deep-sleep wakeup system clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_DSPWUSSEL_IRC64MDIV: ck_dspwussel select IRC64MDIV
      \arg        RCU_DSPWUSSEL_LPIRC4M: ck_dspwussel select LPIRC4M
    \param[out] none
    \retval     none
*/
void rcu_deepsleep_wakeup_sys_clock_config(uint32_t ck_dspwussel)
{

