wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rcu.c
    /* reset the DSPWUSSEL bits and set according to ck_dspwussel */
    RCU_CFG3 &= ~RCU_CFG3_DSPWUSSEL;
    RCU_CFG3 |= ck_dspwussel & RCU_CFG3_DSPWUSSEL;
}

/*!
    \brief      configure the TLI clock division selection (API_ID(0x002DU))
    \param[in]  pll2_r_div: PLL2R divider used as input of TLI
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL2R_DIVx (x = 2,4,8,16): PLL2R divided x used as input of TLI
    \param[out] none
    \retval     none
*/
void rcu_tli_clock_div_config(uint32_t pll2_r_div)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the PLL2RDIV bit and set according to pll2_r_div */
    reg &= ~RCU_CFG1_PLL2RDIV;
    RCU_CFG1 = reg | (pll2_r_div & RCU_CFG1_PLL2RDIV);
}

/*!
    \brief      configure the USARTx (x = 0,1,2,5) clock source selection (API_ID(0x002EU))
    \param[in]  usart_idx: IDX_USARTx (x = 0,1,2,5)
    \param[in]  ck_usart: USART clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USARTSRC_APB: CK_USART select CK_APB1(USART1 / USART2) or CK_APB2(USART0 / USART5)
      \arg        RCU_USARTSRC_AHB: CK_USART select CK_AHB
      \arg        RCU_USARTSRC_LXTAL: CK_USART select CK_LXTAL
      \arg        RCU_USARTSRC_IRC64MDIV: CK_USART select CK_IRC64MDIV
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_usart_clock_config(usart_idx_enum usart_idx, uint32_t ck_usart)
{
    switch(usart_idx) {
    case IDX_USART0:
        /* reset the USART0SEL bits and set according to ck_usart */
        RCU_CFG1 &= ~RCU_CFG1_USART0SEL;
        RCU_CFG1 |= ck_usart & RCU_CFG1_USART0SEL;
        break;
    case IDX_USART1:
        /* reset the USART1SEL bits and set according to ck_usart */
        RCU_CFG1 &= ~RCU_CFG1_USART1SEL;
        RCU_CFG1 |= (ck_usart << 18U) & RCU_CFG1_USART1SEL;
        break;
    case IDX_USART2:
        /* reset the USART2SEL bits and set according to ck_usart */
        RCU_CFG1 &= ~RCU_CFG1_USART2SEL;
        RCU_CFG1 |= (ck_usart << 20U) & RCU_CFG1_USART2SEL;
        break;
    case IDX_USART5:
        /* reset the USART5SEL bits and set according to ck_usart */
        RCU_CFG1 &= ~RCU_CFG1_USART5SEL;
        RCU_CFG1 |= (ck_usart << 22U) & RCU_CFG1_USART5SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the I2Cx (x = 0,1,2,3) clock source selection (API_ID(0x002FU))
    \param[in]  i2c_idx: IDX_I2Cx (x = 0,1,2,3)
    \param[in]  ck_i2c: I2C clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2CSRC_APB1: CK_I2C select CK_APB1
      \arg        RCU_I2CSRC_PLL2R: CK_I2C select CK_PLL2R
      \arg        RCU_I2CSRC_IRC64MDIV: CK_I2C select CK_IRC64MDIV
      \arg        RCU_I2CSRC_LPIRC4M: CK_I2C select CK_LPIRC4M
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_i2c_clock_config(i2c_idx_enum i2c_idx, uint32_t ck_i2c)
{
    switch(i2c_idx) {
    case IDX_I2C0:
        /* reset the I2C0SEL bits and set according to ck_i2c */
        RCU_CFG0 &= ~RCU_CFG0_I2C0SEL;
        RCU_CFG0 |= (ck_i2c << 30U) & RCU_CFG0_I2C0SEL;
        break;
    case IDX_I2C1:
        /* reset the I2C1SEL bits and set according to ck_i2c */
        RCU_CFG3 &= ~RCU_CFG3_I2C1SEL;
        RCU_CFG3 |= ck_i2c & RCU_CFG3_I2C1SEL;
        break;
    case IDX_I2C2:
        /* reset the I2C2SEL bits and set according to ck_i2c */
        RCU_CFG3 &= ~RCU_CFG3_I2C2SEL;
        RCU_CFG3 |= (ck_i2c << 2U) & RCU_CFG3_I2C2SEL;
        break;
    case IDX_I2C3:
        /* reset the I2C3SEL bits and set according to ck_i2c */
        RCU_CFG3 &= ~RCU_CFG3_I2C3SEL;
        RCU_CFG3 |= (ck_i2c << 4U) & RCU_CFG3_I2C3SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the CANx (x = 0,1,2) clock source selection (API_ID(0x0030U))
    \param[in]  can_idx: IDX_CANx (x = 0,1,2)
    \param[in]  ck_can: CAN clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CANSRC_HXTAL: CK_CAN select CK_HXTAL
      \arg        RCU_CANSRC_APB2: CK_CAN select CK_APB2
      \arg        RCU_CANSRC_APB2_DIV2: CK_CAN select CK_APB2 / 2
      \arg        RCU_CANSRC_IRC64MDIV: CK_CAN select CK_IRC64MDIV
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_can_clock_config(can_idx_enum can_idx, uint32_t ck_can)
{
    switch(can_idx) {
    case IDX_CAN0:
        /* reset the CAN0SEL bits and set according to ck_can */
        RCU_CFG1 &= ~RCU_CFG1_CAN0SEL;
        RCU_CFG1 |= ck_can & RCU_CFG1_CAN0SEL;
        break;
    case IDX_CAN1:
        /* reset the CAN1SEL bits and set according to ck_can */
        RCU_CFG1 &= ~RCU_CFG1_CAN1SEL;
        RCU_CFG1 |= (ck_can << 2U) & RCU_CFG1_CAN1SEL;
        break;
    case IDX_CAN2:
        /* reset the CAN2SEL bits and set according to ck_can */
        RCU_CFG1 &= ~RCU_CFG1_CAN2SEL;
        RCU_CFG1 |= (ck_can << 4U) & RCU_CFG1_CAN2SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the ADCx (x = 0,1,2) clock source selection (API_ID(0x0031U))
    \param[in]  adc_idx: IDX_ADCx (x = 0,1,2)
    \param[in]  ck_adc: ADC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_ADCSRC_PLL1P: CK_ADC select CK_PLL1P
      \arg        RCU_ADCSRC_PLL2R: CK_ADC select CK_PLL2R
      \arg        RCU_ADCSRC_PER: CK_ADC select CK_PER
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(adc_idx_enum adc_idx, uint32_t ck_adc)
{
    switch(adc_idx) {
    case IDX_ADC0:
    case IDX_ADC1:
        /* reset the ADC0SEL/ADC1SEL bits and set according to ck_adc */
        RCU_CFG3 &= ~RCU_CFG3_ADC01SEL;
        RCU_CFG3 |= ck_adc & RCU_CFG3_ADC01SEL;
        break;
    case IDX_ADC2:
        /* reset the ADC2SEL bits and set according to ck_adc */
        RCU_CFG3 &= ~RCU_CFG3_ADC2SEL;
        RCU_CFG3 |= (ck_adc << 2U) & RCU_CFG3_ADC2SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the SAIx (x = 0,1,3) clock source selection (API_ID(0x0032U))
    \param[in]  can_idx: IDX_SAIx (x = 0,1,3)
    \param[in]  ck_sai: SAI clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SAISRC_PLL0Q: CK_SAI select CK_PLL0Q
      \arg        RCU_SAISRC_PLL1P: CK_SAI select CK_PLL2R
      \arg        RCU_SAISRC_PLL2P: CK_SAI select CK_PLL2P
      \arg        RCU_SAISRC_I2S_CKIN: CK_SAI select CK_PLL2R
      \arg        RCU_SAISRC_PER: CK_SAI select CK_PER
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_sai_clock_config(sai_idx_enum sai_idx, uint32_t ck_sai)
{
    switch(sai_idx) {
    case IDX_SAI0:
        /* reset the SAI0SEL bits and set according to ck_sai */
        RCU_CFG2 &= ~RCU_CFG2_SAI0SEL;
        RCU_CFG2 |= ck_sai & RCU_CFG2_SAI0SEL;
        break;
    case IDX_SAI1:
    case IDX_SAI3:
        /* reset the SAI1SEL bits and set according to ck_sai */
        RCU_CFG2 &= ~RCU_CFG2_SAI1_3SEL;
        RCU_CFG2 |= (ck_sai << 4U) & RCU_CFG2_SAI1_3SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the SAI2Bx (x = 0,1) clock source selection (API_ID(0x0033U))
    \param[in]  sai2b_idx: IDX_SAI2Bx (x = 0,1)
    \param[in]  ck_sai2b: SAI clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SAI2BSRC_PLL0Q: CK_SAI2B select CK_PLL0Q
      \arg        RCU_SAI2BSRC_PLL1P: CK_SAI2B select CK_PLL2R
      \arg        RCU_SAI2BSRC_PLL2P: CK_SAI2B select CK_PLL2P
      \arg        RCU_SAI2BSRC_I2S_CKIN: CK_SAI2B select I2S_CKIN
      \arg        RCU_SAI2BSRC_PER: CK_SAI2B select CK_PER
      \arg        RCU_SAI2BSRC_RSPDIF_SYMB: CK_SAI2B select CK_RSPDIF_SYMB
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_sai2_block_clock_config(sai2b_idx_enum sai2b_idx, uint32_t ck_sai2b)
{
    switch(sai2b_idx) {
    case IDX_SAI2B0:
        /* reset the SAI2B0SEL bits and set according to ck_sai2b */
        RCU_CFG2 &= ~RCU_CFG2_SAI2B0SEL;
        RCU_CFG2 |= ck_sai2b & RCU_CFG2_SAI2B0SEL;
        break;
    case IDX_SAI2B1:
        /* reset the SAI2B1SEL bits and set according to ck_sai2b */
        RCU_CFG2 &= ~RCU_CFG2_SAI2B1SEL;
        RCU_CFG2 |= (ck_sai2b << 4U) & RCU_CFG2_SAI2B1SEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the RSPDIF clock source selection (API_ID(0x0034U))
    \param[in]  ck_rspdif: RSPDIF clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RSPDIFSRC_PLL0Q: CK_RSPDIF select CK_PLL0Q
      \arg        RCU_RSPDIFSRC_PLL1R: CK_RSPDIF select CK_PLL1R
      \arg        RCU_RSPDIFSRC_PLL2R: CK_RSPDIF select CK_PLL2R
      \arg        RCU_RSPDIFSRC_IRC64MDIV: CK_RSPDIF select CK_IRC64MDIV
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_rspdif_clock_config(uint32_t ck_rspdif)
{
    /* reset the RSPDIFSEL bits and set according to ck_rspdif */
    RCU_CFG1 &= ~RCU_CFG1_RSPDIFSEL;
    RCU_CFG1 |= ck_rspdif & RCU_CFG1_RSPDIFSEL;
}

/*!
    \brief      configure the EXMC clock source selection (API_ID(0x0035U))
    \param[in]  ck_exmc: EXMC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_EXMCSRC_AHB: CK_EXMC select CK_AHB
      \arg        RCU_EXMCSRC_PLL0Q: CK_EXMC select CK_PLL0Q
      \arg        RCU_EXMCSRC_PLL1R: CK_EXMC select CK_PLL1R
      \arg        RCU_EXMCSRC_PER: CK_EXMC select CK_PER
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_exmc_clock_config(uint32_t ck_exmc)
{
    /* reset the EXMCSEL bits and set according to ck_exmc */
    RCU_CFG4 &= ~RCU_CFG4_EXMCSEL;
    RCU_CFG4 |= ck_exmc & RCU_CFG4_EXMCSEL;
}

/*!
    \brief      configure the HPDF clock source selection (API_ID(0x0036U))
    \param[in]  ck_hpdf: HPDF clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFSRC_APB2: CK_HPDF select CK_APB2
      \arg        RCU_HPDFSRC_AHB: CK_HPDF select CK_AHB
    \param[out] none
    \retval     none
    \note       need to check the target clock whether to ready before enabling or switching dynamically
*/
void rcu_hpdf_clock_config(uint32_t ck_hpdf)
{
    /* reset the HPDFSEL bits and set according to ck_hpdf */
    RCU_CFG1 &= ~RCU_CFG1_HPDFSEL;
    RCU_CFG1 |= ck_hpdf & RCU_CFG1_HPDFSEL;
}

/*!
    \brief      configure the peripheral clock source selection (API_ID(0x0037U))
    \param[in]  ck_per: PER clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PERSRC_IRC64MDIV: CK_PER select CK_IRC64MDIV
      \arg        RCU_PERSRC_LPIRC4M: CK_PER select CK_LPIRC4M
      \arg        RCU_PERSRC_HXTAL: CK_PER select CK_HXTAL
    \param[out] none
    \retval     none
*/
void rcu_per_clock_config(uint32_t ck_per)
{
    /* reset the PERSEL bits and set according to ck_per */
    RCU_CFG1 &= ~RCU_CFG1_PERSEL;
    RCU_CFG1 |= ck_per & RCU_CFG1_PERSEL;
}

/*!
    \brief      configure the PLL1Q prescaler (API_ID(0x0038U))
    \param[in]  usbhs_idx: IDX_USBHSx (x = 0,1)
    \param[in]  ck_usbhspsc: USBHS clock prescaler from CK_PLL1Q
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBHSPSC_DIV1: CK_PLL1Q / 1
      \arg        RCU_USBHSPSC_DIV2: CK_PLL1Q / 2
      \arg        RCU_USBHSPSC_DIV3: CK_PLL1Q / 3
      \arg        RCU_USBHSPSC_DIV4: CK_PLL1Q / 4
      \arg        RCU_USBHSPSC_DIV5: CK_PLL1Q / 5
      \arg        RCU_USBHSPSC_DIV6: CK_PLL1Q / 6
      \arg        RCU_USBHSPSC_DIV7: CK_PLL1Q / 7
      \arg        RCU_USBHSPSC_DIV8: CK_PLL1Q / 8
    \param[out] none
    \retval     none
*/
void rcu_usbhs_pll1qpsc_config(usbhs_idx_enum usbhs_idx, uint32_t ck_usbhspsc)
{

    switch(usbhs_idx) {
    case IDX_USBHS0:
        /* reset the USBHS0PSC bits and set according to ck_usbhspsc */
        RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS0PSC;
        RCU_USBCLKCTL |= ck_usbhspsc & RCU_USBCLKCTL_USBHS0PSC;
        break;
    case IDX_USBHS1:
        /* reset the USBHS1PSC bits and set according to ck_usbhspsc */
        RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS1PSC;
        RCU_USBCLKCTL |= (ck_usbhspsc << 3U) & RCU_USBCLKCTL_USBHS1PSC;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the USBHS48M clock source selection (API_ID(0x0039U))
    \param[in]  usbhs_idx: IDX_USBHSx (x = 0,1)
    \param[in]  ck_usb48m: USBHS48MSEL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USB48MSRC_PLL0R: CK_USB48M select CK_PLL0R
      \arg        RCU_USB48MSRC_PLLUSBHS: CK_USB48M select CK_PLLUSBHSx / USBHxSDV (only for USBHS0)
      \arg        RCU_USB48MSRC_PLL1Q: CK_USB48M select CK_PLL1Q / USBHSxPSC
      \arg        RCU_USB48MSRC_IRC48M: CK_USB48M select CK_IRC48M
    \param[out] none
    \retval     none
*/
void rcu_usb48m_clock_config(usbhs_idx_enum usbhs_idx, uint32_t ck_usb48m)
{
    switch(usbhs_idx) {
    case IDX_USBHS0:
        /* reset the USB048MSEL bits and set according to ck_usb48m */
        RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS048MSEL;
        RCU_USBCLKCTL |= ck_usb48m & RCU_USBCLKCTL_USBHS048MSEL;
        break;
    case IDX_USBHS1:
        /* reset the USB148MSEL bits and set according to ck_usb48m */
        RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS148MSEL;
        RCU_USBCLKCTL |= (ck_usb48m << 8U) & RCU_USBCLKCTL_USBHS148MSEL;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the USBHS0 clock source selection (API_ID(0x003AU))
    \param[in]  ck_usbhs: USBHSSEL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBHSSEL_48M: CK_USBHS select 48M
      \arg        RCU_USBHSSEL_60M: CK_USBHS select 60M
    \param[out] none
    \retval     none
*/
void rcu_usbhs0_clock_config(uint32_t ck_usbhs)
{
    /* reset the USBHS0SEL bits and set according to ck_usbhs */
    RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS0SEL;
    RCU_USBCLKCTL |= ck_usbhs & RCU_USBCLKCTL_USBHS0SEL ;
}

/*!
    \brief      enable the USBHS0 clock source selection (API_ID(0x003BU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_usbhs0_clock_selection_enable(void)
{
    /* set the USB0SWEN bit  */
    RCU_USBCLKCTL |= RCU_USBCLKCTL_USBHS0SWEN;
}

/*!
    \brief      disable the USBHS0 clock source selection (API_ID(0x003CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_usbhs0_clock_selection_disable(void)
{
    /* reset the USB0SWEN bit  */
    RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS0SWEN;
}

/*!
    \brief      DSI preceding stage clock source selection (API_ID(0x003DU))
    \param[in]  ck_dsi: DSI preceding stage clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_DSIPRESEL_IRC64MDIV: CK_IRC64MDIV selected as DSI preceding stage source clock
      \arg        RCU_DSIPRESEL_HXTAL: CK_HXTAL selected as DSI preceding stage source clock
    \param[out] none
    \retval     none
*/
void rcu_dsi_preceding_stage_clock_config(uint32_t ck_dsi)
{
    uint32_t reg;

