wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_rcu.c
    reg = RCU_CFG1;
    /* reset the DSIPRESEL bit */
    reg &= ~RCU_CFG1_DSIPRESEL;
    RCU_CFG1 = reg | (ck_dsi & RCU_CFG1_DSIPRESEL);
}

/*!
    \brief      DSI clock division selection (API_ID(0x003EU))
    \param[in]  ck_dsi_div: DSI clock division selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_DSI_DIV1: DSI clock division factor is 1
      \arg        RCU_DSI_DIV2: DSI clock division factor is 2
      \arg        RCU_DSI_DIV3: DSI clock division factor is 3
      \arg        RCU_DSI_DIV4: DSI clock division factor is 4
      \arg        RCU_DSI_DIV5: DSI clock division factor is 5
      \arg        RCU_DSI_DIV6: DSI clock division factor is 6
      \arg        RCU_DSI_DIV7: DSI clock division factor is 7
      \arg        RCU_DSI_DIV8: DSI clock division factor is 8
      \arg        RCU_DSI_DIV9: DSI clock division factor is 9
      \arg        RCU_DSI_DIV10: DSI clock division factor is 10
      \arg        RCU_DSI_DIV11: DSI clock division factor is 11
      \arg        RCU_DSI_DIV12: DSI clock division factor is 12
      \arg        RCU_DSI_DIV13: DSI clock division factor is 13
      \arg        RCU_DSI_DIV14: DSI clock division factor is 14
      \arg        RCU_DSI_DIV15: DSI clock division factor is 15
      \arg        RCU_DSI_DIV16: DSI clock division factor is 16
    \param[out] none
    \retval     none
*/
void rcu_dsi_clock_div_config(uint32_t ck_dsi_div)
{
    uint32_t reg;

    reg = RCU_CFG3;
    /* reset the DSIDIV bit */
    reg &= ~RCU_CFG3_DSIDIV;
    RCU_CFG3 = reg | (ck_dsi_div & RCU_CFG3_DSIDIV);
}

/*!
    \brief      NVMC Flash clock source selection (API_ID(0x003FU))
    \param[in]  ck_nvmc_flash: NVMC flash clock source
                only one parameter can be selected which is shown as below:
      \arg        RCU_NVMC_FLASHSRC_AHB: NVMC flash select CK_AHB
      \arg        RCU_NVMC_FLASHSRC_AHB_DIV2: NVMC flash select CK_AHB /2
      \arg        RCU_NVMC_FLASHSRC_PLL1R: NVMC flash select CK_PLL1R
      \arg        RCU_NVMC_FLASHSRC_PLL2R: NVMC flash select CK_PLL2R
    \param[out] none
    \retval     none
*/
void rcu_nvmc_flash_clock_config(uint32_t ck_nvmc_flash)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the NVMC_FLASHSEL bit  */
    reg &= ~RCU_CFG1_NVMC_FLASHSEL;
    RCU_CFG1 = reg | (ck_nvmc_flash & RCU_CFG1_NVMC_FLASHSEL);
}

/*!
    \brief      ESC clock division selection (API_ID(0x0040U))
    \param[in]  ck_esc_div: ESC clock division
                only one parameter can be selected which is shown as below:
      \arg        RCU_ESC_DIV1: ESC clock division factor is 1
      \arg        RCU_ESC_DIV2: ESC clock division factor is 2
      \arg        RCU_ESC_DIV3: ESC clock division factor is 3
      \arg        RCU_ESC_DIV4: ESC clock division factor is 4
      \arg        RCU_ESC_DIV5: ESC clock division factor is 5
      \arg        RCU_ESC_DIV6: ESC clock division factor is 6
      \arg        RCU_ESC_DIV7: ESC clock division factor is 7
      \arg        RCU_ESC_DIV8: ESC clock division factor is 8
    \param[out] none
    \retval     none
*/
void rcu_esc_clock_div_config(uint32_t ck_esc_div)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the ESCDIV bit  */
    reg &= ~RCU_CFG1_ESCDIV;
    RCU_CFG1 = reg | (ck_esc_div & RCU_CFG1_ESCDIV);
}

/*!
    \brief      ESC clock source selection (API_ID(0x0041U))
    \param[in]  ck_esc: ESC clock source
                only one parameter can be selected which is shown as below:
      \arg        RCU_ESCSRC_AHB: ESC select CK_AHB
      \arg        RCU_ESCSRC_PLL0R: ESC select CK_PLL0R
      \arg        RCU_ESCSRC_PLL1P: ESC select CK_PLL1P
      \arg        RCU_ESCSRC_PLL2Q: ESC select I2S_PLL2Q
    \param[out] none
    \retval     none
*/
void rcu_esc_clock_config(uint32_t ck_esc)
{
    uint32_t reg;

    reg = RCU_CFG1;
    /* reset the ESCSEL bit  */
    reg &= ~RCU_CFG1_ESCSEL;
    RCU_CFG1 = reg | (ck_esc & RCU_CFG1_ESCSEL);
}

/*!
    \brief      OSPI clock source selection (API_ID(0x0042U))
    \param[in]  ck_ospi: OSPI clock source
                only one parameter can be selected which is shown as below:
      \arg        RCU_OSPI_AHB: OSPI select CK_AHB
      \arg        RCU_OSPI_PLL0Q: OSPI select CK_PLL0Q
      \arg        RCU_OSPI_PLL1R: OSPI select CK_PLL1R
      \arg        RCU_OSPI_IRC64MDIV: OSPI select CK_IRC64MDIV
    \param[out] none
    \retval     none
*/
void rcu_ospi_clock_config(uint32_t ck_ospi)
{
    uint32_t reg;

    reg = RCU_CFG4;
    /* reset the OSPISEL bit  */
    reg &= ~RCU_CFG4_OSPISEL;
    RCU_CFG4 = reg | (ck_ospi & RCU_CFG4_OSPISEL);
}

/*!
    \brief      ENCODER clock source selection (API_ID(0x0043U))
    \param[in]  ck_encoder: ENCODER clock source
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENCODER_SYS: ENCODER select CK_SYS
      \arg        RCU_ENCODER_PLL0Q: ENCODER select CK_PLL0Q
      \arg        RCU_ENCODER_PLL1R: ENCODER select CK_PLL1R
      \arg        RCU_ENCODER_PLL2R: ENCODER select CK_PLL2R
    \param[out] none
    \retval     none
*/
void rcu_encoder_clock_config(uint32_t ck_encoder)
{
    uint32_t reg;

    reg = RCU_CFG6;
    /* reset the ENCODERSEL bit  */
    reg &= ~RCU_CFG6_ENCODERSEL;
    RCU_CFG6 = reg | (ck_encoder & RCU_CFG6_ENCODERSEL);
}

/*!
    \brief      HDSL clock source selection (API_ID(0x0044U))
    \param[in]  ck_hdsl: HDSL clock source
                only one parameter can be selected which is shown as below:
      \arg        RCU_HDSL_SYS: HDSL select CK_SYS
      \arg        RCU_HDSL_PLL0R: HDSL select CK_PLL0R
      \arg        RCU_HDSL_PLL1P: HDSL select CK_PLL1P
      \arg        RCU_HDSL_PLL2Q: HDSL select CK_PLL2Q
    \param[out] none
    \retval     none
*/
void rcu_hdsl_clock_config(uint32_t ck_hdsl)
{
    uint32_t reg;

    reg = RCU_CFG6;
    /* reset the HDSL bit  */
    reg &= ~RCU_CFG6_HDSLSEL;
    RCU_CFG6 = reg | (ck_hdsl & RCU_CFG6_HDSLSEL);
}

/*!
    \brief      AFMT clock division selection (API_ID(0x0045U))
    \param[in]  ck_afmt_div: AFMT clock division
                only one parameter can be selected which is shown as below:
      \arg        RCU_AFMT_DIV1: AFMT clock division factor is 1
      \arg        RCU_AFMT_DIV2: AFMT clock division factor is 2
      \arg        RCU_AFMT_DIV3: AFMT clock division factor is 3
      \arg        RCU_AFMT_DIV4: AFMT clock division factor is 4
      \arg        RCU_AFMT_DIV5: AFMT clock division factor is 5
      \arg        RCU_AFMT_DIV6: AFMT clock division factor is 6
      \arg        RCU_AFMT_DIV7: AFMT clock division factor is 7
      \arg        RCU_AFMT_DIV8: AFMT clock division factor is 8
      \arg        RCU_AFMT_DIV9: AFMT clock division factor is 9
      \arg        RCU_AFMT_DIV10: AFMT clock division factor is 10
      \arg        RCU_AFMT_DIV11: AFMT clock division factor is 11
      \arg        RCU_AFMT_DIV12: AFMT clock division factor is 12
      \arg        RCU_AFMT_DIV13: AFMT clock division factor is 13
      \arg        RCU_AFMT_DIV14: AFMT clock division factor is 14
      \arg        RCU_AFMT_DIV15: AFMT clock division factor is 15
      \arg        RCU_AFMT_DIV16: AFMT clock division factor is 16
    \param[out] none
    \retval     none
*/
void rcu_afmt_clock_div_config(uint32_t ck_afmt_div)
{
    uint32_t reg;

    reg = RCU_CFG6;
    /* reset the AFMTDIV bit  */
    reg &= ~RCU_CFG6_AFMTDIV;
    RCU_CFG6 = reg | (ck_afmt_div & RCU_CFG6_AFMTDIV);
}

/*!
    \brief      TFMT clock division selection (API_ID(0x0046U))
    \param[in]  ck_tfmt_div: TFMT clock division
                only one parameter can be selected which is shown as below:
      \arg        RCU_TFMT_DIV1: TFMT clock division factor is 1
      \arg        RCU_TFMT_DIV2: TFMT clock division factor is 2
      \arg        RCU_TFMT_DIV3: TFMT clock division factor is 3
      \arg        RCU_TFMT_DIV4: TFMT clock division factor is 4
      \arg        RCU_TFMT_DIV5: TFMT clock division factor is 5
      \arg        RCU_TFMT_DIV6: TFMT clock division factor is 6
      \arg        RCU_TFMT_DIV7: TFMT clock division factor is 7
      \arg        RCU_TFMT_DIV8: TFMT clock division factor is 8
      \arg        RCU_TFMT_DIV9: TFMT clock division factor is 9
      \arg        RCU_TFMT_DIV10: TFMT clock division factor is 10
      \arg        RCU_TFMT_DIV11: TFMT clock division factor is 11
      \arg        RCU_TFMT_DIV12: TFMT clock division factor is 12
      \arg        RCU_TFMT_DIV13: TFMT clock division factor is 13
      \arg        RCU_TFMT_DIV14: TFMT clock division factor is 14
      \arg        RCU_TFMT_DIV15: TFMT clock division factor is 15
      \arg        RCU_TFMT_DIV16: TFMT clock division factor is 16
    \param[out] none
    \retval     none
*/
void rcu_tfmt_clock_div_config(uint32_t ck_tfmt_div)
{
    uint32_t reg;

    reg = RCU_CFG6;
    /* reset the TFMFDIV bit  */
    reg &= ~RCU_CFG6_TFMFDIV;
    RCU_CFG6 = reg | (ck_tfmt_div & RCU_CFG6_TFMFDIV);
}

/*!
    \brief      ENDAT clock division selection (API_ID(0x0047U))
    \param[in]  ck_endat_div: ENDAT clock division
                only one parameter can be selected which is shown as below:
      \arg        RCU_ENDAT_DIV1: ENDAT clock division factor is 1
      \arg        RCU_ENDAT_DIV2: ENDAT clock division factor is 2
      \arg        RCU_ENDAT_DIV3: ENDAT clock division factor is 3
      \arg        RCU_ENDAT_DIV4: ENDAT clock division factor is 4
      \arg        RCU_ENDAT_DIV5: ENDAT clock division factor is 5
      \arg        RCU_ENDAT_DIV6: ENDAT clock division factor is 6
      \arg        RCU_ENDAT_DIV7: ENDAT clock division factor is 7
      \arg        RCU_ENDAT_DIV8: ENDAT clock division factor is 8
      \arg        RCU_ENDAT_DIV9: ENDAT clock division factor is 9
      \arg        RCU_ENDAT_DIV10: ENDAT clock division factor is 10
      \arg        RCU_ENDAT_DIV11: ENDAT clock division factor is 11
      \arg        RCU_ENDAT_DIV12: ENDAT clock division factor is 12
      \arg        RCU_ENDAT_DIV13: ENDAT clock division factor is 13
      \arg        RCU_ENDAT_DIV14: ENDAT clock division factor is 14
      \arg        RCU_ENDAT_DIV15: ENDAT clock division factor is 15
      \arg        RCU_ENDAT_DIV16: ENDAT clock division factor is 16
    \param[out] none
    \retval     none
*/
void rcu_endat_clock_div_config(uint32_t ck_endat_div)
{
    uint32_t reg;

    reg = RCU_CFG6;
    /* reset the ENDATDIV bit  */
    reg &= ~RCU_CFG6_ENDATDIV;
    RCU_CFG6 = reg | (ck_endat_div & RCU_CFG6_ENDATDIV);
}

/*!
    \brief      HDSL clock division selection (API_ID(0x0048U))
    \param[in]  ck_hdsl_div: HDSL clock division
                only one parameter can be selected which is shown as below:
      \arg        RCU_HDSL_DIV1: HDSL clock division factor is 1
      \arg        RCU_HDSL_DIV2: HDSL clock division factor is 2
      \arg        RCU_HDSL_DIV3: HDSL clock division factor is 3
      \arg        RCU_HDSL_DIV4: HDSL clock division factor is 4
      \arg        RCU_HDSL_DIV5: HDSL clock division factor is 5
      \arg        RCU_HDSL_DIV6: HDSL clock division factor is 6
      \arg        RCU_HDSL_DIV7: HDSL clock division factor is 7
      \arg        RCU_HDSL_DIV8: HDSL clock division factor is 8
    \param[out] none
    \retval     none
*/
void rcu_hdsl_clock_div_config(uint32_t ck_hdsl_div)
{
    uint32_t reg;

    reg = RCU_CFG6;
    /* reset the OSPISEL bit  */
    reg &= ~RCU_CFG6_HDSLDIV;
    RCU_CFG6 = reg | (ck_hdsl_div & RCU_CFG6_HDSLDIV);
}

/*!
    \brief      configure the LXTAL drive capability (API_ID(0x0049U))
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_LOWDRI: lower driving capability
      \arg        RCU_LXTAL_MED_LOWDRI: middle driving capability
      \arg        RCU_LXTAL_MED_HIGHDRI: higher driving capability
      \arg        RCU_LXTAL_HIGHDRI: stronger driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    uint32_t reg;

    reg = RCU_BDCTL;

    /* reset the LXTALDRI bits and set according to lxtal_dricap */
    reg &= ~RCU_BDCTL_LXTALDRI;
    RCU_BDCTL = reg | (lxtal_dricap & RCU_BDCTL_LXTALDRI);
}

/*!
    \brief      wait for oscillator stabilization flags is SET or oscillator startup is timeout (API_ID(0x004AU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC64M: IRC64M
      \arg        RCU_IRC48M: IRC48M
      \arg        RCU_IRC32K: IRC32K
      \arg        RCU_LPIRC4M: LPIRC4M
      \arg        RCU_PLL0_CK: PLL0
      \arg        RCU_PLL1_CK: PLL1
      \arg        RCU_PLL2_CK: PLL2
      \arg        RCU_PLLUSBHS0_CK: PLLUSBHS0
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;

    switch(osci) {
    /* wait HXTAL stable */
    case RCU_HXTAL:
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_HXTALSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait LXTAL stable */
    case RCU_LXTAL:
        while((RESET == osci_stat) && (LXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_LXTALSTB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_LXTALSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait IRC64M stable */
    case RCU_IRC64M:
        while((RESET == osci_stat) && (IRC64M_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC64MSTB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC64MSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait IRC48M stable */
    case RCU_IRC48M:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC48MSTB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC48MSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait IRC32K stable */
    case RCU_IRC32K:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC32KSTB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC32KSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait LPIRC4M stable */
    case RCU_LPIRC4M:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_LPIRC4MSTB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_LPIRC4MSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait PLL0 stable */
    case RCU_PLL0_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLL0STB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_PLL0STB)) {
            reval = SUCCESS;
        }
        break;
    /* wait PLL1 stable */
    case RCU_PLL1_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLL1STB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_PLL1STB)) {
            reval = SUCCESS;
        }
        break;
    /* wait PLL2 stable */
    case RCU_PLL2_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLL2STB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_PLL2STB)) {
            reval = SUCCESS;
        }
        break;
    /* wait PLLUSBHS0 stable */
    case RCU_PLLUSBHS0_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLLUSBHS0STB);
            stb_cnt++;
        }

        /* check whether flag is set */
        if(RESET != rcu_flag_get(RCU_FLAG_PLLUSBHS0STB)) {
            reval = SUCCESS;
        }
        break;
    default:
        break;
    }

    /* return value */
    return reval;
}

/*!
    \brief      turn on the oscillator (API_ID(0x004BU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC64M: IRC64M
      \arg        RCU_IRC48M: IRC48M
      \arg        RCU_IRC32K: IRC32K
      \arg        RCU_LPIRC4M: LPIRC4M
      \arg        RCU_PLL0_CK: PLL0
      \arg        RCU_PLL1_CK: PLL1
      \arg        RCU_PLL2_CK: PLL2
      \arg        RCU_PLLUSBHS0_CK: PLLUSBHS0
    \param[out] none
    \retval     none
*/
void rcu_osci_on(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) |= BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      turn off the oscillator (API_ID(0x004CU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC64M: IRC64M
      \arg        RCU_IRC48M: IRC48M
      \arg        RCU_IRC32K: IRC32K
      \arg        RCU_LPIRC4M: LPIRC4M
      \arg        RCU_PLL0_CK: PLL
      \arg        RCU_PLL1_CK: PLL1
      \arg        RCU_PLL2_CK: PLL2
      \arg        RCU_PLLUSBHS0_CK: PLLUSBHS0
    \param[out] none
    \retval     none
*/
void rcu_osci_off(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) &= ~BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x004DU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator (HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator (LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
    /* enable HXTAL to bypass mode */
    case RCU_HXTAL:
        reg = RCU_CTL;
        RCU_CTL &= ~RCU_CTL_HXTALEN;
        RCU_CTL = (reg | RCU_CTL_HXTALBPS);
        break;
    /* enable LXTAL to bypass mode */
    case RCU_LXTAL:
        reg = RCU_BDCTL;
        RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
        RCU_BDCTL = (reg | RCU_BDCTL_LXTALBPS);
        break;
    default:
        break;
    }
}

/*!
    \brief      disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x004EU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator (HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator (LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
    /* disable HXTAL to bypass mode */
    case RCU_HXTAL:
        reg = RCU_CTL;
        RCU_CTL &= ~RCU_CTL_HXTALEN;
        RCU_CTL = (reg & ~RCU_CTL_HXTALBPS);
        break;
    /* disable LXTAL to bypass mode */
    case RCU_LXTAL:
        reg = RCU_BDCTL;
        RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
        RCU_BDCTL = (reg & ~RCU_BDCTL_LXTALBPS);
        break;
    default:
        break;
    }
}

/*!
    \brief      set the IRC64M adjust value (API_ID(0x004FU))
    \param[in]  irc64M_adjval: IRC64M adjust value, must be between 0 and 0x7F
      \arg        0x00 - 0x7F
    \param[out] none
    \retval     none
*/
void rcu_irc64m_adjust_value_set(uint32_t irc64m_adjval)
{
    uint32_t reg;

    reg = RCU_CTL;
    /* reset the IRC64MADJ bits and set according to irc64m_adjval */
    reg &= ~RCU_CTL_IRC64MADJ;
    RCU_CTL = reg | (irc64m_adjval & RCU_IRC64M_ADJUST_MASK);
}

/*!
    \brief      set the LPIRC4M adjust value (API_ID(0x0050U))
    \param[in]  lpirc4M_adjval: LPIRC4M adjust value, must be between 0 and 0x3F
      \arg        0x00 - 0x3F
    \param[out] none
    \retval     none
*/
void rcu_lpirc4m_adjust_value_set(uint32_t lpirc4m_adjval)
{
    uint32_t reg;

    reg = RCU_ADDCTL1;
    /* reset the LPIRC4MADJ bits and set according to lpirc4M_adjval */
    reg &= ~RCU_ADDCTL1_LPIRC4MADJ;
    RCU_ADDCTL1 = reg | ((lpirc4m_adjval & RCU_LPIRC4M_ADJUST_MASK) << RCU_LPIRC4M_ADJUST_OFFSET);
}

/*!
    \brief      enable the HXTAL clock monitor (API_ID(0x0051U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_enable(void)
{
    RCU_CTL |= RCU_CTL_CKMEN;
}

/*!
    \brief      disable the HXTAL clock monitor (API_ID(0x0052U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_disable(void)
{
    RCU_CTL &= ~RCU_CTL_CKMEN;
}

/*!
    \brief      enable the LXTAL clock monitor (API_ID(0x0053U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_clock_monitor_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_LCKMEN;
}

/*!
    \brief      disable the LXTAL clock monitor (API_ID(0x0054U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_lxtal_clock_monitor_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_LCKMEN;
}

/*!
    \brief      enable the clock frequency monitor (API_ID(0x0055U))
    \param[in]  ckfm: clock frequency monitor enable types, refer to rcu_ckfm_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC64MCKFM: IRC64M clock frequency monitor
      \arg        RCU_LPIRC4MCKFM: LPIRC4M clock frequency monitor
      \arg        RCU_HXTALCKFM: HXTAL clock frequency monitor
      \arg        RCU_PLL0PCKFM: PLL0P clock frequency monitor
    \param[out] none
    \retval     none
*/
void rcu_clock_freq_monitor_enable(rcu_ckfm_enum ckfm)
{
    RCU_REG_VAL(ckfm) |= BIT(RCU_BIT_POS(ckfm));
}

